constant = {}

--常用配置

constant.pz_xrjn =  {{3,3},{7,3},{26,3},{27,3},{12,3}}                                                    --新人技能



constant.pz_hanzi          = {"一","二","三","四","五","六","七","八","九","十",}                            --汉字
constant.pz_ldql          = {}        --每日清理称号
constant.pz_jndy          = {"基本剑术","施毒术","攻杀剑术","刺杀剑术","半月弯刀","烈火剑法","野蛮冲撞","逐日剑法","开天斩","十步一杀"}        --技能抵御
constant.pz_txzrjl       = {"128元真实充值","40元真实充值","38元真实充值","36元真实充值","32元真实充值","30元真实充值","28元真实充值","26元真实充值","24元真实充值","22元真实充值"}

constant.zs_zhuangbeiwei = {
    [401] = 74,
    [402] = 75,
    [403] = 76,
    [404] = 85,
    [405] = 86,
    [406] = 88,
    [407] = 89,
    [408] = 90,
    [409] = 91,
    [410] = 92,
    [411] = 93,
    [412] = 94,
    [413] = 95,
    [414] = 96,
    [415] = 97,
    [416] = 98,
    [417] = 99,
    [418] = 100,
    [419] = 101,
    [420] = 102,
    [421] = 103,
    [422] = 115,
    [423] = 116,
    [424] = 117,
    [425] = 118,
    [426] = 119,
}
--禁止鞭尸怪物
constant.pz_jzbs          = {

}
constant.cz_jeyz = {[18] = 1,[38] = 2,[68] = 3,[128] = 4,[288] = 5,[588] = 6,[888] = 7,[1188] = 8,[1588] = 9,[1888] = 10}


constant.pz_htqx = {[1313760734] = "lll"}           --后台权限
constant.pz_zbfc = {[1313760734] = "lll"}                  --主播扶持权限




--任务类型 1.按钮  2.NPC  3.背包  4.直接奖励 5.双层NPC后刷新杀怪任务  6. 直传找NPC后刷新杀怪任务 任意怪  7.直传找NPC后刷新杀怪任务 BOSS  8.直传找NPC后刷新杀怪任务 小怪+BOSS 
--验证类型  1.字符串,变量,键值,数值   2.装备位置,装备IDX  3.称号名字  4.装备附加属性 位置,组别,比例,dj
--特殊任务类型，ts = {num,{}}
--1：提交次数类
--2：杀怪类  包括单只 + 多个
--3：提交多个  多次物品类
constant.rw_syb = {
    [1] = {99},

    [1300] = {50,"剑门外门",21,96,76}, --除魔天地间
}




return constant