constant = {}

--常用配置
constant.pz_xrjn =  {{3,3},{7,3},{27,3},{12,3},{66,3},{56,3},{26,3}}                                                    --新人技能

constant.pz_hanzi          = {"一","二","三","四","五","六","七","八","九","十",}                            --汉字
constant.pz_ldql          = {}        --每日清理称号
constant.pz_jndy          = {"基本剑术","施毒术","攻杀剑术","刺杀剑术","半月弯刀","烈火剑法","野蛮冲撞","逐日剑法","开天斩","十步一杀"}        --技能抵御
constant.pz_txzrjl       = {"128元真实充值","40元真实充值","38元真实充值","36元真实充值","32元真实充值","30元真实充值","28元真实充值","26元真实充值","24元真实充值","22元真实充值"}
--禁止鞭尸怪物
constant.pz_jzbs          = {

}
constant.cz_jeyz = {[18] = 1,[38] = 2,[68] = 3,[128] = 4,[288] = 5,[588] = 6,[888] = 7,[1188] = 8,[1588] = 9,[1888] = 10}


constant.pz_htqx = {[1313760734] = "lll"}           --后台权限
constant.pz_zbfc = {[1313760734] = "lll"}                  --主播扶持权限




--任务类型 1.按钮  2.NPC  3.背包  4.直接奖励 5.双层NPC后刷新杀怪任务  6. 直传找NPC后刷新杀怪任务 任意怪  7.直传找NPC后刷新杀怪任务 BOSS  8.直传找NPC后刷新杀怪任务 小怪+BOSS 
--验证类型  1.字符串,变量,键值,数值   2.装备位置,装备IDX  3.称号名字  4.装备附加属性 位置,组别,比例,dj
--特殊任务类型，ts = {num,{}}
--1：提交次数类
--2：杀怪类  包括单只 + 多个
--3：提交多个  多次物品类
constant.rw_syb = {
    --领取新人礼包（技能+自动XX）
    [1] = {6,18},
    --领取免费赞助-1
    [2] = {1,16,jx = true},
    --领取天书
    [3] = {4,"领取天书",ktg = 1,["jl"] = {["hb"] = {{3,50000,"绑定元宝"},{4,5000,"绑定灵符"}},wp = {{"天书",1}}}},
    --图1击杀怪物10只
    [4] = {2,"xtc",201,129,142,["sg"] = {{["山庄"] = true},10},jx = true},
    --开启自动回收
    [5] = {3,"背包",ktg = 1,["jl"] = {wp = {{"切割[lv1]",1}}}},
    --升级切割之斧
    [6] = {2,"xtc",6,129,131,jx = true,["jl"] = {wp = {{"攻速[lv1]",1}}}},
    --升级攻速之镰
    [7] = {2,"xtc",7,133,131,jx = true},
    --图2击杀怪物15只
    [8] = {2,"xtc",202,133,142,["sg"] = {{["幽谷"] = true},10},jx = true,["jl"] = {wp = {{"斗笠[lv1]",1}}}},
    --强化斗笠
    [9] = {2,"xtc",8,137,131,jx = true,["jl"] = {wp = {{"复活戒指",1},{"麻痹戒指",1}}}},
    --强化特戒
    [10] = {2,"xtc",9,141,131,jx = true},
    --图3击杀怪物20只
    [11] = {2,"xtc",203,137,142,["sg"] = {{["洞穴"] = true},20},jx = true,["jl"] = {wp = {{"魂体[lv1]",1}}}},
    --魂体淬炼强化
    [12] = {2,"xtc",10,145,131,jx = true},
    --图4击杀怪物20只
    [13] = {2,"xtc",204,141,142,["sg"] = {{["古殿"] = true},20},jx = true},
    --好感度
    [14] = {2,"xtc",13,137,135,jx = true},
    --境界提升
    [15] = {14,["jl"] = {wp = {{"转生材料（一）",1}}}},
    --一大陆转生
    [16] = {2,"xtc",32,128,122,jx = true},
    --进入二大陆
    [17] = {2,"xtc",502,128,141},
    --灵根使者
    --主线引导结束
    [18] = {6,11},


    --[1300] = {50,"剑门外门",21,96,76}, --除魔天地间
}

return constant