daluditu = {
    ["xtc"] = 1,
    ["二大陆主城"] = 2,
    ["三大陆主城"] = 3,
    ["四大陆主城"] = 4,
    ["五大陆主城"] = 5,
    ["六大陆主城"] = 6,
    ["七大陆主城"] = 7,
    ["八大陆主城"] = 8,
    ["九大陆主城"] = 9,
    ["十大陆主城"] = 10,

    ["山庄"] = 1,
    ["幽谷"] = 1,
    ["洞穴"] = 1,
    ["古殿"] = 1,
    ["山庄一"] = 1,
    ["幽谷一"] = 1,
    ["洞穴一"] = 1,
    ["古殿一"] = 1,


    ["隐藏地图二"] = 2,
    ["特殊秘境副本二"] = 2,
    ["野火帮"] = 2,
    ["野火帮大营"] = 2,
    ["极光城郊"] = 2,
    ["神秘森林"] = 2,
    ["兵道古藏"] = 2,
    ["乱葬岗"] = 2,
    ["夜魔洞"] = 2,
    ["洞穴深处"] = 2,
    ["洞穴秘境"] = 2,



    ["隐藏地图三"] = 3,
    ["特殊秘境副本三"] = 3,
    ["灰界"] = 3,
    ["灰界南部"] = 3,
    ["灰界北部"] = 3,
    ["灰界东部"] = 3,
    ["灰界西部"] = 3,
    ["虚妄山脉"] = 3,
    ["鬼嘲深渊"] = 3,
    ["叹息旷野"] = 3,
    ["禁忌之海"] = 3,
    
    ["藏星海"] = 3,
    ["藏星外海"] = 3,
    ["神秘岛屿"] = 3,
    ["黑暗洞窟"] = 3,
    ["千年沉船"] = 3,
    ["船长室"] = 3,
    ["水手舱"] = 3,
    ["藏星内海"] = 3,
    ["七星岛"] = 3,
    ["葬星城"] = 3,
    ["葬星海滩"] = 3,
    ["苍云城"] = 3,
    ["苍云城郊外"] = 3,
    ["苍云内城"] = 3,
    ["苍云客栈"] = 3,
    ["通天塔"] = 3,
    ["通天塔底层"] = 3,
    ["通天塔顶层"] = 3,
    ["草药谷"] = 3,
    ["仙草田"] = 3,
    ["草药古深处"] = 3,
    ["丹道古藏"] = 3,


    ["无主深渊"] = 4,
    ["深渊1层"] = 4,
    ["深渊2层"] = 4,
    ["深渊3层"] = 4,
    ["深渊4层"] = 4,
    ["深渊5层"] = 4,
    ["深渊6层"] = 4,
    ["深渊7层"] = 4,



    ["天玄秘境"] = 5,

    ["凌云福地"] = 6,

}
return daluditu
