daluditu = {
    ["xtc"] = 1,
    ["剑门外门"] = 2,
    ["剑门内门"] = 3,
    ["中州城"] = 4,
    ["天玄界"] = 5,
    ["北境仙域"] = 6,
    ["中央仙域"] = 7,
    ["诡异位面"] = 8,
    ["叹息旷野"] = 9,
    ["诸天之上"] = 10,

    ["山庄"] = 1,
    ["幽谷"] = 1,
    ["洞穴"] = 1,
    ["古殿"] = 1,


    ["隐藏地图二"] = 2,
    ["特殊秘境副本二"] = 2,
    ["野火帮"] = 2,
    ["野火帮大营"] = 2,
    ["xx城郊"] = 2,
    ["神秘森林"] = 2,
    ["兵道古藏"] = 2,
    ["乱葬岗"] = 2,
    ["夜魔洞"] = 2,
    ["洞穴深处"] = 2,
    ["洞穴秘境"] = 2,



    ["隐藏地图三"] = 3,
    ["特殊秘境副本三"] = 3,
    ["灰界"] = 3,
    ["灰界南部"] = 3,
    ["灰界北部"] = 3,
    ["灰界东部"] = 3,
    ["灰界西部"] = 3,
    ["群星海"] = 3,
    ["外海"] = 3,
    ["神秘岛屿"] = 3,
    ["黑暗洞窟"] = 3,
    ["千年沉船"] = 3,
    ["船长室"] = 3,
    ["水手舱"] = 3,
    ["内海"] = 3,
    ["七星岛"] = 3,
    ["葬星城"] = 3,
    ["葬星海滩"] = 3,
    ["红尘城"] = 3,
    ["红尘城郊外"] = 3,
    ["红尘内城"] = 3,
    ["红尘客栈"] = 3,
    ["通天塔"] = 3,
    ["通天塔底层"] = 3,
    ["通天塔顶层"] = 3,
    ["无主深渊"] = 3,
    ["深渊1层"] = 3,
    ["深渊2层"] = 3,
    ["深渊3层"] = 3,
    ["深渊4层"] = 3,
    ["深渊5层"] = 3,
    ["深渊6层"] = 3,
    ["深渊7层"] = 3,
    ["草药谷"] = 3,
    ["仙草田"] = 3,
    ["草药古深处"] = 3,
    ["丹道古藏"] = 3,


    ["虚渊界"] = 4,



    ["天玄秘境"] = 5,

    ["凌云福地"] = 6,

}
return daluditu
