huishou = {
	-- 物品ID = {回收组别,回收金币，回收元宝}
    ["zzhs"] = {
        [60001]={1,1,'焚天赤刃',1,1},



    },
    ["zsfj"] = {
        [50001]={1,1,'龙魂吊坠',100,10},



    },
    ["fzfj"] = {
        [60461]={1,1,'狂·九霄头盔',5,200},


    },
    ["clfj"] = {
        [10501]={1,1,'通关文牒',1,1},


    },
    ["sqhs"] = {
        [20944]={6,10,0},--日耀圣环

    },
    ["grss"] = {
        [60051]={"星河·君归",10000},

    },
    ["qfsb"] = {
        [60052]={"星河·破碎",30000},

    },
    ["bossss"] = {
        [5000]={"烬狱残侯",10000},

    },
    ["kexiaohui"] = {
        [21024] = {1,1,'神魂LV1',1,1},   --神魂LV1


    },
    ["teshuhuihsou"] = {
        [10501]=true,--通关文牒 -



    }
}
return huishou