teshudata = {
    ["npc_1"] = {
        id = 1,
        name = "灵根鉴定",
        config = {
            --配置
            {name = "金灵根",attr_desc = "固定攻击",attr = 4,range = {1,10},redrange = 8},
            {name = "木灵根",attr_desc = "固定生命",attr = 1,range = {10,100},redrange = 80},
            {name = "水灵根",attr_desc = "固定魔法",attr = 2,range = {1,10},redrange = 8},
            {name = "火灵根",attr_desc = "固定物防",attr = 10,range = {1,10},redrange = 8},
            {name = "土灵根",attr_desc = "固定魔防",attr = 12,range = {1,10},redrange = 8},
        },
    },
    ["npc_6"] = {
        id = 6,
        name = "切割之斧",
        where = 9,
        max_level = 15,
        config = {
            --配置
            [1] = {give = "切割[lv2]",cost = { {"元宝",1} },},
            [2] = {give = "切割[lv3]",cost = { {"元宝",1} },},
            [3] = {give = "切割[lv4]",cost = { {"元宝",1} },},
            [4] = {give = "切割[lv5]",cost = { {"元宝",1} },},
            [5] = {give = "切割[lv6]",cost = { {"元宝",1} },},
            [6] = {give = "切割[lv7]",cost = { {"元宝",1} },},
            [7] = {give = "切割[lv8]",cost = { {"元宝",1} },},
            [8] = {give = "切割[lv9]",cost = { {"元宝",1} },},
            [9] = {give = "切割[lv10]",cost = { {"元宝",1} },},
            [10] = {give = "切割[lv11]",cost = { {"元宝",1} },},
            [11] = {give = "切割[lv12]",cost = { {"元宝",1} },},
            [12] = {give = "切割[lv13]",cost = { {"元宝",1} },},
            [13] = {give = "切割[lv14]",cost = { {"元宝",1} },},
            [14] = {give = "切割[lv15]",cost = { {"元宝",1} },},
            [15] = {give = "空",cost = { {"元宝",1} },},
        },
    },
    ["npc_7"] = {
        id = 7,
        name = "攻速",
        where = 15,
        max_level = 10,
        config = {
            --配置
            [1] = {give = "攻速[lv2]",cost = { {"元宝",1} },},
            [2] = {give = "攻速[lv3]",cost = { {"元宝",1} },},
            [3] = {give = "攻速[lv4]",cost = { {"元宝",1} },},
            [4] = {give = "攻速[lv5]",cost = { {"元宝",1} },},
            [5] = {give = "攻速[lv6]",cost = { {"元宝",1} },},
            [6] = {give = "攻速[lv7]",cost = { {"元宝",1} },},
            [7] = {give = "攻速[lv8]",cost = { {"元宝",1} },},
            [8] = {give = "攻速[lv9]",cost = { {"元宝",1} },},
            [9] = {give = "攻速[lv10]",cost = { {"元宝",1} },},
            [10] = {give = "空",cost = { {"元宝",1} },},

        },
    },
    ["npc_8"] = {
        id = 8,
        name = "斗笠",
        where = 13,
        max_level = 11,
        config = {
            --配置
            [1] = {give = "斗笠[lv2]",cost = { {"元宝",1} },},
            [2] = {give = "斗笠[lv3]",cost = { {"元宝",1} },},
            [3] = {give = "斗笠[lv4]",cost = { {"元宝",1} },},
            [4] = {give = "斗笠[lv5]",cost = { {"元宝",1} },},
            [5] = {give = "斗笠[lv6]",cost = { {"元宝",1} },},
            [6] = {give = "斗笠[lv7]",cost = { {"元宝",1} },},
            [7] = {give = "斗笠[lv8]",cost = { {"元宝",1} },},
            [8] = {give = "斗笠[lv9]",cost = { {"元宝",1} },},
            [9] = {give = "斗笠[lv10]",cost = { {"元宝",1} },},
            [10] = {give = "斗笠[lv11]",cost = { {"元宝",1} },},
            [11] = {give = "空",cost = { {"元宝",1} },},

        },
    },
    ["npc_9"] = {
        id = 9,
        name = "特戒",
        where = {12,14},
        max_level = 11,
        config = {
            --配置
            [1] = {
                [1] = {give = "复活戒指[lv1]",cost = { {"元宝",1} },},
                [2] = {give = "复活戒指[lv2]",cost = { {"元宝",1} },},
                [3] = {give = "复活戒指[lv3]",cost = { {"元宝",1} },},
                [4] = {give = "复活戒指[lv4]",cost = { {"元宝",1} },},
                [5] = {give = "复活戒指[lv5]",cost = { {"元宝",1} },},
                [6] = {give = "复活戒指[lv6]",cost = { {"元宝",1} },},
                [7] = {give = "复活戒指[lv7]",cost = { {"元宝",1} },},
                [8] = {give = "复活戒指[lv8]",cost = { {"元宝",1} },},
                [9] = {give = "复活戒指[lv9]",cost = { {"元宝",1} },},
                [10] = {give = "复活戒指[lv10]",cost = { {"元宝",1} },},
                [11] = {give = "空",cost = { {"元宝",1} },},
            },
            [2] = {
                [1] = {give = "麻痹戒指[lv1]",cost = { {"元宝",1} },},
                [2] = {give = "麻痹戒指[lv2]",cost = { {"元宝",1} },},
                [3] = {give = "麻痹戒指[lv3]",cost = { {"元宝",1} },},
                [4] = {give = "麻痹戒指[lv4]",cost = { {"元宝",1} },},
                [5] = {give = "麻痹戒指[lv5]",cost = { {"元宝",1} },},
                [6] = {give = "麻痹戒指[lv6]",cost = { {"元宝",1} },},
                [7] = {give = "麻痹戒指[lv7]",cost = { {"元宝",1} },},
                [8] = {give = "麻痹戒指[lv8]",cost = { {"元宝",1} },},
                [9] = {give = "麻痹戒指[lv9]",cost = { {"元宝",1} },},
                [10] = {give = "麻痹戒指[lv10]",cost = { {"元宝",1} },},
                [11] = {give = "空",cost = { {"元宝",1} },},
            },


        },
    },
    ["npc_10"] = {
        id = 10,
        name = "魂体",
        where = 2,
        max_level = 11,
        config = {
            --配置
            [1] = {give = "魂体[lv2]",cost = { {"元宝",1} },},
            [2] = {give = "魂体[lv3]",cost = { {"元宝",1} },},
            [3] = {give = "魂体[lv4]",cost = { {"元宝",1} },},
            [4] = {give = "魂体[lv5]",cost = { {"元宝",1} },},
            [5] = {give = "魂体[lv6]",cost = { {"元宝",1} },},
            [6] = {give = "魂体[lv7]",cost = { {"元宝",1} },},
            [7] = {give = "魂体[lv8]",cost = { {"元宝",1} },},
            [8] = {give = "魂体[lv9]",cost = { {"元宝",1} },},
            [9] = {give = "魂体[lv10]",cost = { {"元宝",1} },},
            [10] = {give = "魂体[lv11]",cost = { {"元宝",1} },},
            [11] = {give = "空",cost = { {"元宝",1} },},

        },
    },
    ["npc_11"] = {
        id = 11,
        name = "灵根修炼",
        randomdata = { 100, 30, 30, 30, 30, 30, 30, 30, 20, 20 },
        fake_randomdata = { 100, 30, 30, 30, 30, 30, 30, 30, 20, 20 },
        max_level = 10,
        attrID = {21,25,26,28,30},
        cost =  { {"元宝",1} },
        max_cost =  { {"元宝",10} },
        title = "灵根修炼一",
        config = {
            --配置
            [1] = {name = "金灵根",attr_desc = "暴击几率增加",ratio = 1},
            [2] = {name = "木灵根",attr_desc = "增加攻击伤害",ratio = 1},
            [3] = {name = "水灵根",attr_desc = "伤害吸收",ratio = 1},
            [4] = {name = "火灵根",attr_desc = "忽视防御",ratio = 1},
            [5] = {name = "土灵根",attr_desc = "人物体力",ratio = 1},
        },
    },
    ["npc_12"] = {
        xg_day = 4,
        sd = {
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
            {give = "魂体[lv2]",cost = { {"元宝",1} },},
        }
    },
    ["npc_13"] = {
        id = 13,
        name = "好感度",
        max_level = 10,
        attrID = 244,
        max_give = "兰姐的信物",
        config = {
            --配置
            [0] = {ratio = 0},
            [1] = {ratio = 100,cost =  { {"好感度道具",20} },},
            [2] = {ratio = 200,cost =  { {"好感度道具",40} },},
            [3] = {ratio = 300,cost =  { {"好感度道具",60} },},
            [4] = {ratio = 400,cost =  { {"好感度道具",80} },},
            [5] = {ratio = 500,cost =  { {"好感度道具",100} },},
            [6] = {ratio = 1111,cost =  { {"好感度道具",200} },},
            [7] = {ratio = 1777,cost =  { {"好感度道具",250} },},
            [8] = {ratio = 2333,cost =  { {"好感度道具",300} },},
            [9] = {ratio = 3333,cost =  { {"好感度道具",488} },},
            [10] = {ratio = 5555,cost =  { {"好感度道具",588} },},
        },
    },
    ["npc_14"] = {
        id = 14,
        name = "仙食坊",
        title = "仙食坊全满",
        config = {
            --配置
            [1] = {attr_desc = "攻击力",attrID = 4,ratio = 1,cost =  { {"仙食坊一",1} },max_level = 750,},
            [2] = {attr_desc = "血量",attrID = 1,ratio = 1,cost =  { {"仙食坊二",1} },max_level = 750,},
            [3] = {attr_desc = "切割",attrID = 244,ratio = 80,cost =  { {"仙食坊三",1} },max_level = 550,},
            [4] = {attr_desc = "怪物抵抗",attrID = 255,ratio = 1,cost =  { {"仙食坊四",1} },max_level = 200,},
            [5] = {attr_desc = "爆率",attrID = 242,ratio = 100,cost =  { {"仙食坊五",1} },max_level = 200,},
        },
    },
    ["npc_15"] = {
        id = 15,
        name = "狂暴之力",
        cost = 100,
        give = {
            ch = "狂暴之力",
            skill = "十步一杀",
        },
        death = {
            hb = 500,
        },
    },
    ["npc_20"] = {
        id = 20,
        name = "冠名",
        ch = "踏月主宰",
        jl = { { "龙纹铜钱", 100 },{3,10000000,"绑定元宝"},{4,2000000,"绑定灵符"}},
        ch2 = "绝世无双",
        jl2 = {{ "龙纹铜钱", 400 },{3,40000000,"绑定元宝"},{4,4000000,"绑定灵符"}},
    },

    ["sbk"] = {
        minimum = 600,  --最小积分才能获取奖励
        killPoint = 50, --杀人获得50积分
        killedPoint = 10, --被杀获得10积分
        guaJiPoint = 3, --挂机积分
    },
    ["fldt"] = {
        ["7rqd"] = {
            {jl = { { "好感度道具", 100 },{"绑定元宝",10},{"绑定灵符",10}},},
            {jl = { { "好感度道具", 200 },{"绑定元宝",20},{"绑定灵符",20}},},
            {jl = { { "好感度道具", 300 },{"绑定元宝",30},{"绑定灵符",30}},},
            {jl = { { "好感度道具", 400 },{"绑定元宝",40},{"绑定灵符",40}},},
            {jl = { { "好感度道具", 500 },{"绑定元宝",50},{"绑定灵符",50}},},
            {jl = { { "好感度道具", 600 },{"绑定元宝",60},{"绑定灵符",60}},},
            {jl = { { "好感度道具", 700 },{"绑定元宝",70},{"绑定灵符",70}},},
        },
        ["zxjl"] = {
            {time = 10,jl = { { "好感度道具", 100 },{"绑定元宝",10},{"绑定灵符",10}},},
            {time = 20,jl = { { "好感度道具", 200 },{"绑定元宝",20},{"绑定灵符",20}},},
            {time = 30,jl = { { "好感度道具", 300 },{"绑定元宝",30},{"绑定灵符",30}},},
            {time = 40,jl = { { "好感度道具", 400 },{"绑定元宝",40},{"绑定灵符",40}},},
            {time = 50,jl = { { "好感度道具", 500 },{"绑定元宝",50},{"绑定灵符",50}},},
            {time = 60,jl = { { "好感度道具", 600 },{"绑定元宝",60},{"绑定灵符",60}},},
            {time = 70,jl = { { "好感度道具", 700 },{"绑定元宝",70},{"绑定灵符",70}},},
        },
        ["sgjl"] = {
            {num = 10,jl = { { "好感度道具", 100 },{"绑定元宝",10},{"绑定灵符",10}},},
            {num = 20,jl = { { "好感度道具", 200 },{"绑定元宝",20},{"绑定灵符",20}},},
            {num = 30,jl = { { "好感度道具", 300 },{"绑定元宝",30},{"绑定灵符",30}},},
            {num = 40,jl = { { "好感度道具", 400 },{"绑定元宝",40},{"绑定灵符",40}},},
            {num = 50,jl = { { "好感度道具", 500 },{"绑定元宝",50},{"绑定灵符",50}},},
            {num = 60,jl = { { "好感度道具", 600 },{"绑定元宝",60},{"绑定灵符",60}},},
            {num = 70,jl = { { "好感度道具", 700 },{"绑定元宝",70},{"绑定灵符",70}},},
        },
    }
}
return teshudata
