

xilieditu = {


    ["猎魔前线"] = 1,
    ["血戮荒原"] = 1,
    ["魔息战场"] = 1,
    ["暗影哨所"] = 1,

    ["上古丛林"] = 2,
    ["迷踪秘径"] = 2,
    ["藤蔓荒谷"] = 2,
    ["古木幽庭"] = 2,

    ["灵气矿场"] = 3,
    ["晶尘之路"] = 3,
    ["灵岩矿井"] = 3,
    ["涌泉之脉"] = 3,

    ["不朽领域"] = 4,
    ["永生之塔"] = 4,
    ["不灭神坛"] = 4,
    ["轮回圣殿"] = 4,

    ["诡秘深渊"] = 5,
    ["幽影峡谷"] = 5,
    ["邪魂之渊"] = 5,
    ["深渊幽宫"] = 5,

    ["北辰山脉"] = 6,
    ["霜风雪岭"] = 6,
    ["极寒冰崖"] = 6,
    ["天霄之径"] = 6,

    ["幽冥邪宗"] = 7,
    ["血池溅月"] = 7,
    ["邪影噬魂坛"] = 7,
    ["千目凝视之谷"] = 7,

    ["边境之城"] = 8,
    ["狼烟起"] = 8,
    ["孤军守残垒"] = 8,
    ["铁壁营寨烽火天"] = 8,

    ["无尽深渊"] = 9,
    ["黑渊幽径"] = 9,
    ["深海无声谷"] = 9,
    ["血肉风暴裂魂隙"] = 9,

    ["仙府遗迹"] = 10,
    ["仙池碧玉"] = 10,
    ["莲灯未冷时"] = 10,
    ["星陨回响天幕影"] = 10,

    ["天妖山脉"] = 11,
    ["狂啸绝壁"] = 11,
    ["血兽战吼山巅"] = 11,
    ["妖骨盘涡毒息林"] = 11,

    ["圣墟秘境"] = 12,
    ["圣者归途"] = 12,
    ["光焰引路泉影照"] = 12,
    ["黄金遗冢"] = 12,

    ["迷城幻境"] = 13,
    ["影火幽街"] = 13,
    ["虚实难辨馆中影"] = 13,
    ["星屑回廊"] = 13,

    ["战歌要塞"] = 14,
    ["战鼓不息"] = 14,
    ["铁狮门楼风中望"] = 14,
    ["赤焰兵坊"] = 14,

    ["荒古战场"] = 15,
    ["血腥废墟"] = 15,
    ["废土遗址"] = 15,
    ["英雄遗墟"] = 15,

    ["魁族蛮荒"] = 16,
    ["蛮骨平原"] = 16,
    ["血牙山脉"] = 16,
    ["荒灵沼泽"] = 16,

    ["苍穹之域"] = 17,
    ["云阙天宫"] = 17,
    ["星轮天池"] = 17,
    ["玄霄浮岛"] = 17,

    ["混沌荒原"] = 18,
    ["破界荒墟"] = 18,
    ["湮灵断层"] = 18,
    ["裂魂战渊"] = 18,

    ["赤焰火洲"] = 19,
    ["炎心古原"] = 19,
    ["焰火炼狱"] = 19,
    ["燎原赤林"] = 19,

    ["海蓝天岛"] = 20,
    ["澜光浅湾"] = 20,
    ["云汐悬崖"] = 20,
    ["天镜湖心"] = 20,

    ["禁忌之森"] = 21,
    ["幽藤迷径"] = 21,
    ["幽冥沼泽"] = 21,
    ["暗影秘境"] = 21,

    ["鬼嚎深渊"] = 22,
    ["哀魂断口"] = 22,
    ["魍魉幽道"] = 22,
    ["死域祭坛"] = 22,

    ["无相领域"] = 23,
    ["虚轮镜界"] = 23,
    ["虚幻迷宫"] = 23,
    ["意识荒原"] = 23,

    ["诡异裂缝"] = 24,
    ["灵觉浮域"] = 24,
    ["无名之殿"] = 24,
    ["血腥深渊"] = 24,

    ["夜哭寒泉"] = 25,
    ["死亡古洞"] = 25,
    ["月光禁地"] = 25,
    ["飓涛涌境"] = 25,

    ["蓝珊瑚林"] = 26,
    ["赤光熔坛"] = 26,
    ["赤日神殿"] = 26,
    ["初劫之痕"] = 26,

    ["苍雷裂境"] = 27,
    ["寂寥虚穹"] = 27,
    ["渊炎绝地"] = 27,
    ["蛮神遗坛"] = 27,

    ["古代战堡"] = 28,
    ["雷霆断崖"] = 28,
    ["血焰石阵染疆场"] = 28,
    ["战士归骨"] = 28,

    ["幽梦之庭"] = 29,
    ["幻纹石径迷途归"] = 29,
    ["梦魇之核噩梦醒"] = 29,
    ["圣血石林孤塔声"] = 29,

    ["天启之门"] = 30,
    ["幻沙古径"] = 30,
    ["万蛇洞窟"] = 30,
    ["巨爪绝崖魂断坠"] = 30,

    ["獠牙石道"] = 31,
    ["百目妖湖镜水魂"] = 31,
    ["风雷禁阁"] = 31,
    ["石苑无声沉沙道"] = 31,

    ["灵虚之塔"] = 32,
    ["归墟遗台幻梦庭"] = 32,
    ["迷影石廊"] = 32,
    ["深渊孤灯指引"] = 32,

    ["禁忌裂隙"] = 33,
    ["断魂渊底骸骨路"] = 33,
    ["风沙埋骨镇"] = 33,
    ["暗影酒馆"] = 33,

    ["旧城血染街"] = 34,
    ["烬灰之巷赤火痕"] = 34,
    ["幽火燃骨坛"] = 34,
    ["黄泉尽头石门"] = 34,

    ["黑棺地宫"] = 35,
    ["亡咒残碑归魂"] = 35,
    ["白峰古道"] = 35,
    ["凌云冰谷"] = 35,

    ["诡音回廊"] = 36,
    ["迷魂秘径"] = 36,
    ["阴火祭坛"] = 36,
    ["星陨之境"] = 36,


    ["鸿蒙界障"] = 999,
    ["洪荒世界"] = 999,
    ["寰宇世界"] = 999,
    ["混沌世界"] = 999,







}
return xilieditu
