npc = {}

function npc.main(play,npcid)
	say(play,[[<Img|x=0.0|y=-1.0|width=800|height=800|bg=1|scale9l=15|scale9r=15|scale9t=15|scale9b=15|move=1|loadDelay=1|reset=1|esc=1|img=public/bg_npc_01.png|show=0>
	<Layout|x=801.0|y=0.0|width=80|height=80|link=@exit>
	<Button|x=794|y=0.0|nimg=public/1900000510.png|pimg=public/1900000511.png|link=@exit>
	<Button|x=17|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第1套|link=@gwp,1>
	<Button|x=128|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第2套|link=@gwp,2>
	<Button|x=239|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第3套|link=@gwp,3>
	<Button|x=350|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第4套|link=@gwp,4>
	<Button|x=461|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第5套|link=@gwp,5>
	<Button|x=572|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第6套|link=@gwp,6>
	<Button|x=683|y=21.0|color=251|nimg=public/1900000660.png|size=16|text=第7套|link=@gwp,7>
	<Button|x=17.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第8套|link=@gwp,8>
	<Button|x=128.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第9套|link=@gwp,9>
	<Button|x=239.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第10套|link=@gwp,10>
	<Button|x=350.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第11套|link=@gwp,11>
	<Button|x=461.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第12套|link=@gwp,12>
	<Button|x=572.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第13套|link=@gwp,13>
	<Button|x=683.0|y=68.0|color=251|nimg=public/1900000660.png|size=16|text=第14套|link=@gwp,14>
	<Button|x=17.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第15套|link=@gwp,15>
	<Button|x=128.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第16套|link=@gwp,16>
	<Button|x=239.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第17套|link=@gwp,17>
	<Button|x=350.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第18套|link=@gwp,18>
	<Button|x=461.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第19套|link=@gwp,19>
	<Button|x=572.0|y=116.0|color=251|nimg=public/1900000660.png|size=16|text=第20套|link=@gwp,20>
	<Button|x=17|y=164.0|color=251|nimg=public/1900000660.png|size=16|text=第21套|link=@gwp,21>
	<Button|x=128|y=164.0|color=251|nimg=public/1900000660.png|size=16|text=第22套|link=@gwp,22>
	<Button|x=239|y=164.0|color=251|nimg=public/1900000660.png|size=16|text=第23套|link=@gwp,23>
	<Button|x=350|y=164.0|color=251|nimg=public/1900000660.png|size=16|text=第24套|link=@gwp,24>
	<Button|x=461|y=164.0|color=251|nimg=public/1900000660.png|size=16|text=第25套|link=@gwp,25>
	<Button|x=572|y=200.0|color=251|nimg=public/1900000660.png|size=16|text=第26套|link=@gwp,26>
	<Button|x=683|y=200.0|color=251|nimg=public/1900000660.png|size=16|text=第27套|link=@gwp,27>
	<Button|x=17|y=200.0|color=251|nimg=public/1900000660.png|size=16|text=第28套|link=@gwp,28>
	<Button|x=128|y=200.0|color=251|nimg=public/1900000660.png|size=16|text=第29套|link=@gwp,29>
	<Button|x=239|y=200.0|color=251|nimg=public/1900000660.png|size=16|text=第30套|link=@gwp,30>
	<Button|x=350|y=250.0|color=251|nimg=public/1900000660.png|size=16|text=第31套|link=@gwp,31>
	<Button|x=461|y=250.0|color=251|nimg=public/1900000660.png|size=16|text=第32套|link=@gwp,32>
	<Button|x=572|y=250.0|color=251|nimg=public/1900000660.png|size=16|text=第33套|link=@gwp,33>
	<Button|x=683|y=250.0|color=251|nimg=public/1900000660.png|size=16|text=第34套|link=@gwp,34>
	<Button|x=17|y=250.0|color=251|nimg=public/1900000660.png|size=16|text=第35套|link=@gwp,35>
	<Button|x=128|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第36套|link=@gwp,36>
	<Button|x=239|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第37套|link=@gwp,37>
	<Button|x=350|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第38套|link=@gwp,38>
	<Button|x=461|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第39套|link=@gwp,39>
	<Button|x=572|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第40套|link=@gwp,40>
	<Button|x=683|y=300.0|color=251|nimg=public/1900000660.png|size=16|text=第41套|link=@gwp,41>
	<Button|x=17|y=350.0|color=251|nimg=public/1900000660.png|size=16|text=第42套|link=@gwp,42>
	<Button|x=128|y=350.0|color=251|nimg=public/1900000660.png|size=16|text=第43套|link=@gwp,43>
	<Button|x=239|y=350.0|color=251|nimg=public/1900000660.png|size=16|text=第44套|link=@gwp,44>
	<Button|x=350|y=350.0|color=251|nimg=public/1900000660.png|size=16|text=第45套|link=@gwp,45>
	<Button|x=461|y=350.0|color=251|nimg=public/1900000660.png|size=16|text=第46套|link=@gwp,46>

	]])
end

function buff(play)
    addbuff(play,19994)
end


local data = {
    {
        "焚天赤刃",
        "凌霄火袍",
        "焰冠凌霄",
        "炎心玉链",
        "烈焰戒",
        "赤魂戒",
        "焰灵镯",
        "炽火镯",
        "踏焰靴",
        "火云腰带",
    },
    {
        "寂影",
        "凌霄衣",
        "玄霄盔",
        "空冥链",
        "冥戒",
        "影戒",
        "幽痕镯",
        "归玄镯",
        "乘虚靴",
        "遁冥带",

    },
    {
        '渊息',
        '归墟裳',
        '寂渊冠',
        '幽墟链',
        '渊桀戒',
        '虚戒',
        '寂纹镯',
        '幽极镯',
        '渊行靴',
        '幽玄带',

    },
    {
        '听雪',
        '苍穹衣',
        '雪寂盔',
        '霜影链',
        '听戒',
        '雪戒',
        '空冥镯',
        '玄霜镯',
        '御霜靴',
        '听玄带',

    },
    {
        '渊极',
        '无极裳',
        '云渊盔',
        '虚渊链',
        '极戒',
        '渊戒',
        '云极镯',
        '玄渊镯',
        '御渊靴',
        '无玄带',

    },
    {
        '星河·君归',
        '星河·破碎',
        '星河·时光',
        '星河·心魂',
        '星河·万千',
        '星河·神魔',
        '星河·无她',
        '星河·黑潮',
        '星河·月夜',
        '星河·苦海',

    },
    {
        '青冥天剑',
        '剑宗云衣',
        '冥云战冠',
        '青锋灵链',
        '剑心无极戒',
        '冥影幽魂戒',
        '归锋断空镯',
        '御剑流光镯',
        '踏剑凌风靴',
        '剑隐云霄带',

    },
    {
        '天穹断灭剑',
        '苍穹裂天袍',
        '万象天尊冠',
        '无极神灵链',
        '破天戒指',
        '裂地无双戒',
        '九幽战神镯',
        '雷霆御风镯',
        '踏云裂岳靴',
        '逆天无极带',

    },
    {
        '魔神狂雷刃',
        '霸业镇天甲',
        '神魔战魂盔',
        '灭世龙纹链',
        '魔威无双戒',
        '逆天神罚戒',
        '焚天裂地镯',
        '幽冥断魂镯',
        '裂空踏神靴',
        '无极破天带',

    },
    {
        '烈阳破晓',
        '寒星沉歌',
        '玄冰凝霜',
        '夜雨清歌',
        '赤焰幽兰',
        '皓月流光',
        '苍岚渊梦',
        '幽林静谧',
        '幽雾苍岚',
        '苍羽踏歌',

    },
    {
        '苍穹·热血',
        '苍穹·情义',
        '苍穹·却梦',
        '苍穹·碎邪',
        '苍穹·幽兰',
        '苍穹·无音',
        '苍穹·戒律',
        '苍穹·尘世',
        '苍穹·主宰',
        '苍穹·凡睦',

    },
    {
        '霜华凝露',
        '寒莲幽梦',
        '雪落无声',
        '月华残影',
        '冰魄幽光',
        '苍羽寒霜',
        '玉碎寒烟',
        '冰魂幽幽',
        '凛冬无痕',
        '霜影轻履',

    },
    {
        '幽梦轻歌',
        '雾岚深渊',
        '玄云锁影',
        '漠然流光',
        '幽岚残霞',
        '星河隐现',
        '轻烟缥缈',
        '雾影幽兰',
        '苍岚隐翠',
        '轻雾踏风',

    },
    {
        '流光溢彩',
        '寒烟迷离',
        '紫霄苍穹',
        '梦澜星痕',
        '冷月孤影',
        '苍灵幽岚',
        '星辉隐约',
        '风吟云隐',
        '漠然尘世',
        '轻雷踏歌',

    },
    {
        '玄雷空',
        '云无垠',
        '苍天影',
        '霜流云',
        '雷幽影',
        '玄凌霄',
        '苍凝霜',
        '霜云动',
        '流苍渊',
        '风踏雪',

    },
    {
        '霜焰·怜悯',
        '霜焰·黑海',
        '霜焰·影风',
        '霜焰·苦无',
        '霜焰·寻血',
        '霜焰·暴雷',
        '霜焰·镰幽',
        '霜焰·苍狼',
        '霜焰·血虎',
        '霜焰·纵横',

    },
    {
        '星影',
        '梦光',
        '星梦',
        '幻语',
        '幻星',
        '璀璨',
        '星河',
        '流影',
        '轻澜',
        '踏梦',

    },
    {
        '星河烈焰之锋',
        '云海苍穹披风',
        '玄冰幽冥之冠',
        '幽夜星辰之链',
        '皓月流光环绕',
        '苍岚寒霜之环',
        '冰魂幽梦手镯',
        '风吟夜影佩环',
        '轻雷踏风之履',
        '雾隐天澜腰带',

    },
    {
        '烈霄',
        '寒影',
        '幽冥',
        '星辰',
        '流光',
        '寒霜',
        '幽梦',
        '夜影',
        '踏风',
        '天澜',

    },
    {
        '独念兰',
        '终不还',
        '洛风',
        '三月',
        '雨落',
        '南山',
        '脉霄闻',
        '威龙',
        '思念',
        '无人知',

    },
    {
        '玄霄·再少年',
        '玄霄·尘世间',
        '玄霄·落南山',
        '玄霄·天地合',
        '玄霄·兮归元',
        '玄霄·思年华',
        '玄霄·龙风破',
        '玄霄·玄音起',
        '玄霄·佳人醉',
        '玄霄·响云霄',

    },
    {
        '霜华落',
        '玄影啸',
        '天烛残',
        '琉璃梦',
        '血殇',
        '寒锋隐',
        '焚云',
        '惊鸿泣',
        '傲雪魂',
        '破晓吟',

    },
    {
        '天霜落影',
        '幽歌',
        '焚云诀',
        '断魂惊雷啸',
        '破晓玄光',
        '苍岚',
        '血殇歌',
        '长风归雁啸',
        '寒锋孤影',
        '夜澜',

    },
    {
        '焚雪苍穹',
        '玄风',
        '惊雷啸',
        '落霞飞羽舞',
        '破碎长歌',
        '寒烟',
        '孤月影',
        '剑指天涯路',
        '流光暗影',
        '赤霄',

    },
    {
        '寒霜夜烬',
        '幽岚',
        '烈焰心',
        '惊鸿逐梦行',
        '苍穹落霞',
        '赤焰',
        '孤影泣',
        '断云残月吟',
        '破晓玄霜',
        '残烬',

    },
    {
        '霓凰·曲终',
        '霓凰·微澜',
        '霓凰·叹息',
        '霓凰·青野',
        '霓凰·黑日',
        '霓凰·君言',
        '霓凰·帝威',
        '霓凰·轻语',
        '霓凰·安寂',
        '霓凰·无情',

    },
    {
        '寒霜苍穹',
        '惊雷破晓',
        '流火孤影',
        '夜歌残月',
        '玄冰冷焰',
        '孤云断鸿',
        '破风落霞',
        '暗影幽殇',
        '血影焚魂',
        '苍岚烈焰',

    },
    {
        '烛火凌霄',
        '断魂惊鸿',
        '冷月无痕',
        '苍穹逐影',
        '焚天烈焰',
        '幽冥寒光',
        '风雷破晓',
        '孤影残霞',
        '血染长空',
        '玄冰傲雪',

    },
    {
        '烈焰苍穹',
        '寒光破晓',
        '幽影残月',
        '风雷孤鸿',
        '血染',
        '暗云惊魂',
        '冰封夜歌',
        '落霞惊风',
        '断魂寒霜',
        '苍岚焚天',

    },
    {
        '霜华落漫天',
        '夜阑珊',
        '寒烟起',
        '流云归',
        '惊鸿影',
        '孤月寒',
        '碧落歌',
        '残阳曲',
        '秋水吟',
        '风华泣',

    },
    {
        '云渊·春水',
        '云渊·秽土',
        '云渊·骄阳',
        '云渊·裂空',
        '云渊·帝意',
        '云渊·花雨',
        '云渊·雾起',
        '云渊·春山',
        '云渊·冬雪',
        '云渊·冰魄',

    },
    {
        '惊鸿影归去',
        '九天曲',
        '墨云起',
        '断星落',
        '惊雷碎',
        '孤城暮',
        '寒烟起风',
        '流火焚',
        '天外客',
        '苍狼啸',

    },
    {
        '走龙蛇影',
        '八仙跪地',
        '六千里风',
        '断桥残雪',
        '青云逐月',
        '惊雷破晓处',
        '落霞孤鹜',
        '寒霜染血',
        '夜雨倾城',
        '孤鸿归路',

    },
    {
        '破浪惊涛',
        '浮生若梦',
        '烟雨江南',
        '孤星寒月',
        '天涯海角',
        '风卷残云',
        '血染风华',
        '长歌落寞',
        '寒光冷刃',
        '断魂归途',

    },
    {
        '惊鸿',
        '逐风',
        '断魂',
        '寒光',
        '流火',
        '落霞',
        '孤影',
        '残月',
        '霜刃',
        '夜歌',

    },
    {
        '烟岚·墨',
        '烟岚·白',
        '烟岚·义',
        '烟岚·蛰',
        '烟岚·隼',
        '烟岚·洋',
        '烟岚·梦',
        '烟岚·碧',
        '烟岚·臜',
        '烟岚·悔',

    },
    {
        '破晓行',
        '天狼啸',
        '浮光掠',
        '星落尘',
        '寒霜泪',
        '烟岚起',
        '孤峰云',
        '风雷怒',
        '夜幕寒',
        '流火歌',

    },
    {
        '破霄',
        '凌风',
        '暮影',
        '焚歌',
        '寒岚',
        '落尘',
        '断鸿',
        '残烬-诀',
        '幽泣',
        '孤魄',

    },
    {
        '赤霄烬',
        '冰河梦',
        '苍岚歌',
        '焚魂曲',
        '孤烟野',
        '落星尘',
        '寒霆怒',
        '残风吟',
        '幽谷泣',
        '夜火焰',

    },
    {
        '星渊',
        '裂魂',
        '墨魄',
        '冷霜',
        '惊鸿歌',
        '烬火',
        '风痕',
        '幽岚兰',
        '破云',
        '残阳',

    },
    {
        '幽歌·斩天道',
        '幽歌·锁九天',
        '幽歌·春不语',
        '幽歌·叶知秋',
        '幽歌·浅吟唱',
        '幽歌·烟醉雨',
        '幽歌·洛情弃',
        '幽歌·仙人跪',
        '幽歌·遮云日',
        '幽歌·囚魍魉',

    },
    {
        '月无痕',
        '月倾城',
        '月如歌',
        '月中寒',
        '月上影',
        '月浮光',
        '月照人',
        '月夜泣',
        '月笼沙',
        '月隐魂',

    },
    {
        '孤月寒光',
        '残月如钩',
        '月影流霜',
        '素月沉歌',
        '冷月孤魂',
        '皓月倾城',
        '月下长歌',
        '惊鸿映月',
        '夜寂寒月',
        '月落星沉',

    },
    {
        '月魂',
        '寒辉',
        '月珀',
        '月隐',
        '冷月',
        '月华',
        '素辉',
        '月魄',
        '月澜',
        '月纹',

    },
    {
        '空',
        '绝',
        '若',
        '道',
        '色',
        '怒',
        '悲',
        '恶',
        '哀',
        '天',

    },
    {
        '踏月·指天',
        '踏月·金刚',
        '踏月·天冠',
        '踏月·出世',
        '踏月·清风',
        '踏月·落日',
        '踏月·极道',
        '踏月·归一',
        '踏月·破界',
        '踏月·传奇',

    },
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},


}


local cailiao =
{

}

function cailiaog(play)
    for k, v in pairs(cailiao) do
        giveitem(play,v[1],v[2])
    end
end

function gwp(play,id)
	id = tonumber(id)
	for k, v in pairs(data[id]) do
		giveitem(play,v)
	end

    local bq = #data[id]
    if bq < 10 then
        if bq ~= 10 then
            giveitem(play,"沃玛号角",10-bq)
        end
    elseif bq < 20  then
        if bq ~= 10 then
            giveitem(play,"沃玛号角",20-bq)
        end
    end
end

return npc