npc = {}

npc[1] = function(play,p2,p3,msgData)  --兑换面板
    if p2 == 0 then
        sendluamsg(play,101,3,0,0,'{"hbdh1":'..getplaydef(play,VarCfg.J_hbdh[1])..',"hbdh2":'..getplaydef(play,VarCfg.J_hbdh[2])..'}')
    elseif p2 == 1 then
        if getplaydef(play,VarCfg.J_hbdh[1]) >= 10 then
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>每日兑换次数已达上限...</font>","Type":9}')
            return
        end
        if changemoney(play,3,"-",1000000,"货币兑换",true) then
            changemoney(play,4,"+",200000,"货币兑换",true)
            setplaydef(play,VarCfg.J_hbdh[1], getplaydef(play,VarCfg.J_hbdh[1]) + 1)
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#00ff00\'>兑换成功...</font>","Type":9}')
            sendluamsg(play,101,3,1,1,'{"hbdh1":'..getplaydef(play,VarCfg.J_hbdh[1])..',"hbdh2":'..getplaydef(play,VarCfg.J_hbdh[2])..'}')

        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>元宝不足...</font>","Type":9}')
        end
    elseif p2 == 2 then
        if getplaydef(play,VarCfg.J_hbdh[2]) >= 10 then
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>每日兑换次数已达上限...</font>","Type":9}')
            return
        end
        if changemoney(play,1,"-",1000000,"货币兑换",true) then
            changemoney(play,2,"+",200000,"货币兑换",true)
            setplaydef(play,VarCfg.J_hbdh[2], getplaydef(play,VarCfg.J_hbdh[2]) + 1)
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#00ff00\'>兑换成功...</font>","Type":9}')
            sendluamsg(play,101,3,1,2,'{"hbdh1":'..getplaydef(play,VarCfg.J_hbdh[1])..',"hbdh2":'..getplaydef(play,VarCfg.J_hbdh[2])..'}')

        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>绑定元宝不足...</font>","Type":9}')
        end
    elseif p2 == 3 then
        if changemoney(play,7,"-",1000,"货币兑换",true) then
            changemoney(play,1,"+",2000000,"货币兑换",true)
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#00ff00\'>兑换成功...</font>","Type":9}')
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>仙玉不足...</font>","Type":9}')
        end
    elseif p2 == 4 then
        if changemoney(play,8,"-",1000,"货币兑换",true) then
            changemoney(play,3,"+",2000000,"货币兑换",true)
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#00ff00\'>兑换成功...</font>","Type":9}')
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[货币兑换]</font><font color=\'#ff0000\'>绑定仙玉不足...</font>","Type":9}')
        end
    end
end

npc[2] = function(play,p2,p3,msgData)  --回收面板
    if p2 == 0 then
        sendluamsg(play, 101, 2, 2, 0, '{"xz":'..getplaydef(play,VarCfg.T_hsdg)..',"kg":['..getflagstatus(play,VarCfg.BS_huishou[1])..','..getflagstatus(play,VarCfg.BS_huishou[2])..','..getflagstatus(play,VarCfg.BS_huishou[3])..','..getflagstatus(play,VarCfg.BS_huishou[4])..','..getflagstatus(play,VarCfg.BS_huishou[5])..']}')
    elseif p2 == 1 then
        if p3 > 0 and p2 < 5 then
            msgData = tonumber(msgData)
            if msgData > 0 and msgData < 50 then
                local hspz = json2tbl(getplaydef(play,VarCfg.T_hsdg))
                hspz[p3.."_"..msgData] = 1
                setplaydef(play,VarCfg.T_hsdg,tbl2json(hspz))
            end
        end
    elseif p2 == 2 then
        local hspz = json2tbl(getplaydef(play,VarCfg.T_hsdg))
        if hspz[msgData] and hspz[msgData] == 1 then
            hspz[msgData] = nil
        else
            hspz[msgData] = 1
        end
        setplaydef(play,VarCfg.T_hsdg,tbl2json(hspz))
    elseif p2 == 3 then
    elseif p2 == 4 then
        if p3 == 1 then
            if msgData == "1" then
                sendmsg(play,1,'{"Msg":"<font color=\'#00ff00\'>自动吃灵符已开启...</font>","Type":9}')
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>自动吃灵符已关闭...</font>","Type":9}')
            end
            setflagstatus(play,VarCfg.BS_huishou[1],msgData)
        elseif p3 == 2 then
            if msgData == "1" then
                sendmsg(play,1,'{"Msg":"<font color=\'#00ff00\'>自动吃元宝已开启...</font>","Type":9}')
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>自动吃元宝已关闭...</font>","Type":9}')
            end
            setflagstatus(play,VarCfg.BS_huishou[2],msgData)
        elseif p3 == 3 then
            if msgData == "1" then
                sendmsg(play,1,'{"Msg":"<font color=\'#00ff00\'>自动吃经验已开启...</font>","Type":9}')
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>自动吃经验已关闭...</font>","Type":9}')
            end
            setflagstatus(play,VarCfg.BS_huishou[3],msgData)
        elseif p3 == 4 then
            if msgData == "1" then
                sendmsg(play,1,'{"Msg":"<font color=\'#00ff00\'>自动回收已开启...</font>","Type":9}')
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>自动回收已关闭...</font>","Type":9}')
            end
            setflagstatus(play,VarCfg.BS_huishou[4],msgData)
        elseif p3 == 5 then
            if msgData == "1" then
                sendmsg(play,1,'{"Msg":"<font color=\'#00ff00\'>可提升不回收已开启...</font>","Type":9}')
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>可提升不回收已关闭...</font>","Type":9}')
            end
            setflagstatus(play,VarCfg.BS_huishou[5],msgData)
        end
    elseif p2 == 5 then
        if p3 == 1 then
            local hs = json2tbl(msgData)
            Player.huishou(play, hs)
        end
        Player.zxrw_wancheng(play, 4, "")
    elseif p2 == 6 then --销毁
        local hs = json2tbl(msgData)
        Player.huishou(play, hs)
        sendluamsg(play, 101, 2, 4, 0, '')
    elseif p2 == 7 then
        Player.huishou(play)
        refreshbag(play)
    end
end

npc[3] = function(play)  --仓库面板
    openstorage(play)
end


npc[5] = function(play,p2,p3,data) -- 内挂开关
    setflagstatus(play,VarCfg.BS_ngkg,p2)
    Buff[379](play,p2 == 1 and 1 or 2)
    sendluamsg(play, 103, 1, 0, 0, '{"ngkg":'..p2..'}')
end

npc[6] = function(play,p2,p3,data) -- 屏蔽系统消息
    if getplaydef(play,"N$是否屏蔽系统消息") == 0 then
        setplaydef(play,"N$是否屏蔽系统消息",1)
        filterglobalmsg(play,1)
        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>不在接受系统提示消息...</font>","Type":9}')
    else
        setplaydef(play,"N$是否屏蔽系统消息",0)
        filterglobalmsg(play,0)
        sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>正常接收系统消息...</font>","Type":9}')
    end
end


---异闻录
local npc_xyl = {
    {
        ----任务名,npcid,任务类型（1为主线任务,2为支线任务）,任务检测（1数字型,2数组型,3称号型）,任务结束标志和进度标志,任务传送地点,任务传送限制（{1,10}等级,{2,10}转生,{3,”称号“}所需称号）
        -- {3,3005}  领取任务
        -- {2,2074}  支线 -- 进图领取
        -- {4,3006}  引导类 无实体任务
        --999  无实体npc
        --1  有实体npc  可验证
        --2  有实体npc  装备提升类
        --3  有实体npc  属性提升类
        --4  五实体npc  属性提升类
        --yz = {2,"npc27",2} -- 验证类型为{}
        --yz = {1,"npc27",2} -- 验证类型为数值
    },
    {
        {

        },
        {
            {
                { "进行转职",999,{3,3023}, yd = {1,"剑门外门",166,109,83} ,desc = "<核心/FCOLOR=249>完成二大陆转职\\(<提升核心属性/FCOLOR=250>)" },
                { "横断山脉杀怪",999,{3,3005}, yd = {1,"剑门外门",207,110,88},desc = "在横断山脉击杀15只怪物" },
                { "查看杀怪奖励",999,{4,3006},yd = {2,1,4} ,desc = "点击查看福利大厅中的<杀怪奖励/FCOLOR=250>" },
                { "横断山脉杀怪",999,{3,3007}, yd = {1,"剑门外门",207,110,88} ,desc = "横断山脉击杀5个精英" },
                jl = {hb = {{3,500000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",2}}}
            },
            {
                { "勋章升级",2,yz = {15,20006}, yd = {1,"剑门外门",160,99,97} ,desc = "勋章升级到LV5\\(<提升核心属性/FCOLOR=250>)" },
                { "剑魂遗迹杀怪",999,{3,3009}, yd = {1,"剑门外门",208,109,89} ,desc = "剑魂遗迹杀20只小怪" },
                { "剑魂遗迹杀怪",999,{3,3010}, yd = {1,"剑门外门",208,109,89} ,desc = "剑魂遗迹杀5只精英" },
                { "完成白长老的任务",1,yz = {2,"npc26",2},yd = {1,"剑门外门",208,109,89} },
                jl = {hb = {{3,200000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",2}}}
            },
            {
                { "修为提升",999,{3,3011}, yd = {3,14} ,desc = "修为提升10次\\(<提升核心属性/FCOLOR=250>)" },
                { "查看除魔天地间",999,{3,3012}, yd = {1,"剑门外门",21,106,78} ,desc = "查看<每日任务/FCOLOR=250>除魔天地间\\(<可以每日领取任务获得材料/FCOLOR=250>)" },
                { "完成李长老的任务",1,yz = {1,"npc27",2}, yd = {1,"剑门外门",209,109,90} },
                { "龙魂吊坠",999,{3,3013},yd = {1,"剑门外门",209,109,90} ,desc = "获得专属龙魂吊坠\\(<了解必爆功能/FCOLOR=249>)" },
                jl = {hb = {{3,200000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",2}}}
            },
            {
                { "查看每日副本",999,{3,3014}, yd = {1,"剑门外门",23,109,82} ,desc = "查看<每日/FCOLOR=249>每日副本\\(<可以每日挑战获得材料/FCOLOR=250>)" },
                { "剑鸣深渊杀怪",999,{3,3015}, yd = {1,"剑门外门",210,107,93} ,desc = "剑鸣深渊杀5只精英" },
                { "完成张长老的任务",1,yz = {1,"npc28",2}, yd = {1,"剑门外门",210,107,93} },
                { "王权圣戒",999,{3,3016},yd = {1,"剑门外门",210,107,93} ,desc = "获得专属王权圣戒" },
                jl = {hb = {{3,200000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",2}}}
            },
            {
                --{ "仙途豪礼",999,{3,3017}, yd = {2,1,4},desc = "点击查看福利大厅中的<仙途豪礼/FCOLOR=250>" },
                { "诡冥墨河杀怪",999,{3,3018}, yd = {1,"剑门外门",211,105,95} ,desc = "诡冥墨河杀5只精英" },
                { "完成王长老的任务",1,yz = {2,"npc29",2}, yd = {1,"剑门外门",211,105,95} },
                { "烈焰指环",999,{3,3019},yd = {1,"剑门外门",211,105,95} ,desc = "获得专属烈焰指环" },
                jl = {hb = {{3,200000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"人灵丹",10}}}
            },
            {
                { "合成专属",999,{3,3020}, yd = {1,"剑门外门",175,102,78} ,desc = "<核心/FCOLOR=249>合成专属\\(<合成二大陆顶级专属/FCOLOR=250>)" },
                { "剑冢迷宫杀怪",999,{3,3021}, yd = {1,"剑门外门",212,104,96} ,desc = "剑冢迷宫杀5只精英" },
                { "完成徐长老的任务",1,yz = {1,"npc30",2}, yd = {1,"剑门外门",212,104,96} },
                { "完成转生",999,{3,3022},yd = {1,"剑门外门",54,98,82} ,desc = "<核心/FCOLOR=249>完成二大陆转生\\(<提升核心属性/FCOLOR=250>)" },
                jl = {hb = {{3,200000,"绑定元宝"},{4,20000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",2}}}
            },
        },
        {
            { "大陆服饰"},
            { "除魔天地间"},
            { "剑门声望"},
            { "讨伐协修"},
            { "太虚幻境"},
        },
        {
            {"迷惘森林","龙魂吊坠"},
            {"剑鸣深渊","王权圣戒"},
            {"诡冥墨河","烈焰指环"},
        }
    },
    {
        {

        },
        {
            {
                { "提升八门",11, yd = {4,100,187,0,0},desc = "提升八门-惊门等级到10级" },
                { "查看每日活跃",999,{4,3024},yd = {2,1,16} ,desc = "查看<每日/FCOLOR=249>每日活跃\\(<可以每日挑战获得材料/FCOLOR=250>)" },
                { "完成刘长老的任务",1,yz = {1,"npc31",2}, yd = {1,"剑门内门",213,95,131} },
                { "傲孤寒",999,{4,3025}, yd = {1,"剑门内门",213,95,131},desc = "获得专属傲孤寒" },
                jl = {hb = {{3,300000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",3}}}
            },
            {
                { "强化斗笠",2,yz = {13,21093}, yd = {1,"剑门内门",159,108,106} ,desc = "强化斗笠到LV5\\(<提升核心属性/FCOLOR=250>)" },
                { "查看太虚幻境",999,{3,3026}, yd = {1,"剑门内门",135,100,112} ,desc = "查看<每日/FCOLOR=249>太虚幻境\\(<可以每日挑战获得核心材料/FCOLOR=249>)" },
                { "完成仙像祭祀",1,yz = {1,"npc42",2}, yd = {1,"虚剑洞天",42,24,39} },
                { "月华流影",999,{3,3027},yd = {1,"剑门内门",214,99,131} ,desc = "获得专属月华流影" },
                jl = {hb = {{3,300000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",3},{"技能书页",10}}}
            },
            {
                { "技能强化",999,{3,3028}, yd = {1,"剑门内门",43,103,109} ,desc = "技能强化一次\\(<提升核心属性/FCOLOR=250>)" },
                { "查看宗门禁地",999,{3,3029}, yd = {1,"剑门内门",39,115,117} ,desc = "查看宗门禁地\\(<会产出顶级装备/FCOLOR=250>)" },
                { "完成赤剑试炼",1,yz = {1,"npc530",2}, yd = {1,"赤剑山谷",530,32,42} },
                { "苍穹寂灭",999,{3,3030}, yd = {1,"剑门内门",215,103,131} ,desc = "获得专属苍穹寂灭" },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"雕刻符文",10}}}
            },
            {
                { "合成啸风逐电",999,{3,3031}, yd = {1,"剑门外门",175,112,79},desc = "<核心/FCOLOR=249>合成啸风逐电\\(<合成三大陆顶级专属/FCOLOR=250>)" },
                { "装备雕刻",999,{3,3032}, yd = {1,"剑门内门",35,95,121} ,desc = "<核心/FCOLOR=249>装备雕刻一次\\(<提升核心属性/FCOLOR=250>)" },
                { "完成雷剑试炼",1,yz = {2,"npc531",2}, yd = {1,"雷剑神殿",531,70,29} },
                { "烬海残光",999,{3,3033}, yd = {1,"剑门内门",216,107,131} ,desc = "获得专属烬海残光" },
                jl = {hb = {{3,500000,"绑定元宝"},{4,10000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",3},{"强化石",1}}}
            },
            {
                { "装备强化",999,{3,3034}, yd = {1,"剑门内门",78,95,127} ,desc = "<核心/FCOLOR=249>装备强化一次\\(<提升核心属性/FCOLOR=250>)" },
                { "奇门八阵",999,{3,3053}, yd = {3,14} ,desc = "查看奇门八阵\\(<有各种强力加成/FCOLOR=250>)" },
                { "查看邪修讨伐",999,{3,3035}, yd = {1,"剑门内门",22,101,109} ,desc = "查看邪修讨伐\\(<可获得大量材料货币/FCOLOR=250>)" },
                --{ "查看剑门地位",999,{3,3036}, yd = {1,"剑门内门",24,108,110} ,desc = "查看剑门地位\\(<提升属性,获得货币材料/FCOLOR=250>)" },
                { "惊雷震世",999,{3,3037},yd = {1,"剑门内门",243,111,131} ,desc = "获得专属惊雷震世" },

                jl = {hb = {{3,500000,"绑定元宝"},{4,10000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"地灵丹",10}}}
            },
            {
                { "完成三大陆转生",999,{3,3041},yd = {1,"剑门内门",76,95,129},desc = "<核心/FCOLOR=249>完成三大陆转生\\(<提升核心属性/FCOLOR=250>)" },
                { "雪隐残锋",999,{3,3039}, yd = {1,"剑门内门",244,115,131}  ,desc = "获得专属雪隐残锋" },
                { "合成龙鳞镇岳",999,{3,3040}, yd = {1,"剑门外门",175,112,79} ,desc = "<核心/FCOLOR=249>合成龙鳞镇岳\\(<合成三大陆顶级专属/FCOLOR=250>)" },
                { "英灵哀殿杀怪",999,{3,3038}, yd = {1,"剑门内门",244,115,131} ,desc = "英灵哀殿杀1只BOSS" },
                jl = {hb = {{3,300000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",2},{"1元真实充值",3}}}
            },
        },
        {
            { "大陆服饰"},
            { "除魔天地间"},
            { "剑门声望"},
            { "讨伐协修"},
            { "太虚幻境"},
        },
        {
            {"灵剑之道","傲霜孤"},
            {"虚剑洞天","月华流影"},
            {"赤剑山谷","苍穹寂灭"},
            {"雷剑神殿","烬海残光"},
            {"云崖绝壁","惊雷震世"},
            {"英灵哀殿","雪隐残锋"},
        }
    },
    {
        {

        },
        {
            {
                { "盾牌强化",2,yz = {16,20111}, yd = {1,"中州城",158,648,178},jl = {wp = {{"1元真实充值",1}} } ,desc = "盾牌强化至LV10\\(<提升核心属性/FCOLOR=250>)" },
                { "猎魔前线-救治灵树",1,yz = {2,"npc401",2},yd = {1,"猎魔前线",401,33,27},jl = {wp = {{"1元真实充值",1}} } },
                { "猎魔前线-三相之力",1,yz = {2,"npc402",2},yd = {1,"血戮荒原",402,323,153},jl = {wp = {{"1元真实充值",1}} } },
                { "猎魔前线-祭拜苍天",1,yz = {2,"npc403",2},yd = {1,"魔息战场",403,117,26},jl = {wp = {{"1元真实充值",1}} } },
                { "猎魔前线-除魔问道",1,yz = {2,"npc404",2},yd = {1,"暗影哨所",404,252,67},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",3},{"1元真实充值",4}}}
            },
            {
                { "职业觉醒",3, yd = {1,"中州城",176,654,178},jl = {wp = {{"1元真实充值",1}} } ,desc = "完成职业一觉\\(<激活觉醒技能/FCOLOR=250>)" },
                { "上古丛林-全是好物",1,yz = {1,"npc407",2},yd = {1,"上古丛林",407,69,170},jl = {wp = {{"1元真实充值",1}} } },
                { "上古丛林-酒鬼老王",1,yz = {1,"npc408",2},yd = {1,"迷踪秘径",408,152,29},jl = {wp = {{"1元真实充值",1}} } },
                { "上古丛林-吉祥三宝",1,yz = {1,"npc409",2},yd = {1,"藤蔓荒谷",409,118,45},jl = {wp = {{"1元真实充值",1}} } },
                { "上古丛林-上古剑诀",1,yz = {1,"npc410",2},yd = {1,"古木幽庭",410,167,133},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"开光符",10},{"1元真实充值",4}}}
            },
            {
                { "专属开光",999,{3,3043}, yd = {1,"中州城",183,652,175},jl = {wp = {{"1元真实充值",1}} } ,desc = "查看专属开光\\(<核心玩法，大幅提升属性/FCOLOR=250>)" },
                { "灵气矿场-矿场密宝",1,yz = {1,"npc413",2},yd = {1,"灵气矿场",413,277,27},jl = {wp = {{"1元真实充值",1}} } },
                { "灵气矿场-挖矿达人",1,yz = {1,"npc414",2},yd = {1,"晶尘之路",414,23,259},jl = {wp = {{"1元真实充值",1}} } },
                { "灵气矿场-协助老朽",1,yz = {1,"npc415",2},yd = {1,"灵岩矿井",415,280,55},jl = {wp = {{"1元真实充值",1}} } },
                { "灵气矿场-灵气起源",1,yz = {2,"npc416",2},yd = {1,"涌泉之脉",416,23,268},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",3},{"1元真实充值",4}}}
            },
            {
                { "中州城势力",999,{3,3044}, yd = {1,"中州城",45,652,175},jl = {wp = {{"1元真实充值",1}} } ,desc = "查看中州城传送阵\\(<加入中州城任意势力/FCOLOR=250>)" },
                { "不朽领域-不朽秘宝",1,yz = {1,"npc419",2},yd = {1,"不朽领域",419,35,352},jl = {wp = {{"1元真实充值",1}} } },
                { "不朽领域-老僧的烦恼",1,yz = {1,"npc420",2},yd = {1,"永生之塔",420,66,322},jl = {wp = {{"1元真实充值",1}} } },
                { "不朽领域-不玩虚的",1,yz = {2,"npc421",2},yd = {1,"不灭神坛",421,16,316},jl = {wp = {{"1元真实充值",1}} } },
                { "不朽领域-神秘宝箱",1,yz = {1,"npc422",2},yd = {1,"轮回圣殿",422,276,35},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",3},{"1元真实充值",4}}}
            },
            {
                { "勋章强化",2,yz = {15,20011}, yd = {4,100,160,0,0},jl = {wp = {{"1元真实充值",1}} } ,desc = "徽章强化至LV10\\(<提升核心属性/FCOLOR=250>)" },
                { "诡秘深渊-交个朋友",1,yz = {1,"npc425",2},yd = {1,"诡秘深渊",425,45,141},jl = {wp = {{"1元真实充值",1}} } },
                { "诡秘深渊-智慧之神",1,yz = {2,"npc426",2},yd = {1,"幽影峡谷",426,101,280},jl = {wp = {{"1元真实充值",1}} } },
                { "诡秘深渊-欢度元宵",1,yz = {2,"npc427",2},yd = {1,"邪魂之渊",427,185,200},jl = {wp = {{"1元真实充值",1}} } },
                { "诡秘深渊-上古恶魔",1,yz = {2,"npc428",2},yd = {1,"深渊幽宫",428,19,239},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",3},{"1元真实充值",4}}}
            },
            {
                { "完成四大陆转生",12,{4},yd = {1,"中州城",124,644,192},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>完成四大陆转生\\(<提升核心属性/FCOLOR=250>)" },
                { "北辰山脉-北辰秘宝",1,yz = {1,"npc431",2},yd = {1,"北辰山脉",431,441,220},jl = {wp = {{"1元真实充值",1}} } },
                { "北辰山脉-救济老朽",1,yz = {1,"npc432",2},yd = {1,"霜风雪岭",432,35,222},jl = {wp = {{"1元真实充值",1}} } },
                { "北辰山脉-神秘高人",1,yz = {1,"npc433",2},yd = {1,"极寒冰崖",433,233,38},jl = {wp = {{"1元真实充值",1}} } },
                { "北辰山脉-我摇人了",1,yz = {2,"npc434",2},yd = {1,"天霄之径",434,218,30},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,500000,"绑定元宝"},{4,50000,"绑定灵符"}},wp = {{"龙纹铜钱",3},{"1元真实充值",4}}}
            },
        },
        {
            { "大陆服饰"},
            { "登神长阶"},
        },
        {
            {"猎魔前线","雷霆幻"},
            {"上古丛林","永恒星辰"},
            {"灵气矿场","霜雪之间"},
            {"不朽领域","烈焰焚天"},
            {"诡秘深渊","天罚雷击"},
            {"北辰山脉","炽焰灰烬"},
            {"轮回圣殿","深渊游行"},
            {"深渊幽宫","龙骨战魂"},
            {"天霄之径","寒鸦"},

        },
        {
            {"血戮荒原","阿修罗之眼"},
            {"迷踪秘径","扶摇上青天"},
            {"晶尘之路","桃李满天下"},
            {"永生之塔","狂风起苍穹"},
            {"幽影峡谷","霸天震九州"},
            {"霜风雪岭","狂风之力"},
            {"魔息战场","飞龙在天"},
            {"藤蔓荒谷","霸者傲天下"},
            {"灵岩矿井","死亡彗星"},
            {"不灭神坛","傲骨豪"},
            {"邪魂之渊","破天魂"},
            {"极寒冰崖","地狱火"},

        }
    },
    {
        {

        },
        {

            {
                { "群切强化",4,yd = {1,"天玄界",58,42,38},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>激活群切强化\\(<大幅提高打怪速度/FCOLOR=250>)" },
                { "幽冥邪宗-幽冥至宝",1,yz = {1,"npc437",2},yd = {1,"幽冥邪宗",437,34,39},jl = {wp = {{"1元真实充值",1}} } },
                { "幽冥邪宗-磨刀向恶魔",1,yz = {2,"npc438",2},yd = {1,"血池溅月",438,172,172},jl = {wp = {{"1元真实充值",1}} } },
                { "幽冥邪宗-血洗邪宗",1,yz = {2,"npc439",2},yd = {1,"邪影噬魂坛",439,24,91},jl = {wp = {{"1元真实充值",1}} } },
                { "幽冥邪宗-斩草除根",1,yz = {2,"npc440",2},yd = {1,"千目凝视之谷",440,23,89},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"龙纹铜钱",4},{"1元真实充值",5}}}
            },
            {
                { "根基洗炼",999,{3,3045}, yd = {1,"天玄界",57,51,38},jl = {wp = {{"1元真实充值",1}} } ,desc = "查看根基洗炼\\(<每日可以免费洗炼一次/FCOLOR=250>)" },
                { "边境之城-边境至宝",1,yz = {1,"npc442",2},yd = {1,"边境之城",442,37,67},jl = {wp = {{"1元真实充值",1}} } },
                { "边境之城-边境试炼",1,yz = {2,"npc443",2},yd = {1,"狼烟起",443,31,33},jl = {wp = {{"1元真实充值",1}} } },
                { "边境之城-寻宝神潭",1,yz = {2,"npc444",2},yd = {1,"孤军守残垒",444,33,179},jl = {wp = {{"1元真实充值",1}} } },
                { "边境之城-边境大使",1,yz = {1,"npc445",2},yd = {1,"铁壁营寨烽火天",445,16,141},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"龙纹铜钱",4},{"1元真实充值",5}}}
            },
            {
                { "职业升级",5,yd = {1,"天玄界",168,54,38},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>职业强化至LV100\\(<提升职业属性/FCOLOR=250>)" },
                { "无尽深渊-深渊夺宝",1,yz = {1,"npc447",2},yd = {1,"无尽深渊",447,84,111},jl = {wp = {{"1元真实充值",1}} } },
                { "无尽深渊-无尽神道",1,yz = {2,"npc448",2},yd = {1,"黑渊幽径",448,94,73},jl = {wp = {{"1元真实充值",1}} } },
                { "无尽深渊-深渊谜题",1,yz = {2,"npc449",2},yd = {1,"深海无声谷",449,85,37},jl = {wp = {{"1元真实充值",1}} } },
                { "无尽深渊-收集魔气",1,yz = {1,"npc450",2},yd = {1,"血肉风暴裂魂隙",450,93,97},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"觉醒书页",5},{"1元真实充值",5}}}
            },
            {
                { "仙府遗迹-仙府宝藏",1,yz = {1,"npc452",2},yd = {1,"仙府遗迹",452,121,122},jl = {wp = {{"1元真实充值",1}} } },
                { "仙府遗迹-光暗双生",1,yz = {2,"npc453",2},yd = {1,"仙池碧玉",453,208,208},jl = {wp = {{"1元真实充值",1}} } },
                { "仙府遗迹-无边业火",1,yz = {2,"npc454",2},yd = {1,"莲灯未冷时",454,217,227},jl = {wp = {{"1元真实充值",1}} } },
                { "仙府遗迹-控火导师",1,yz = {2,"npc455",2},yd = {1,"星陨回响天幕影",455,230,198},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"龙纹铜钱",4},{"1元真实充值",5}}}
            },
            {
                { "盾牌强化",2,yz = {16,20141}, yd = {1,"中州城",158,648,178},jl = {wp = {{"1元真实充值",1}} } ,desc = "盾牌强化至LV40\\(<提升核心属性/FCOLOR=250>)" },
                { "副装系统",999,{3,3054}, yd = {1,"天玄界",185,40,38},jl = {wp = {{"1元真实充值",1}} } ,desc = "核心玩法\\副装和转职的结合" },
                { "天妖山脉-天妖夺宝",1,yz = {1,"npc457",2},yd = {1,"天妖山脉",457,301,330},jl = {wp = {{"1元真实充值",1}} } },
                { "天妖山脉-天妖试炼",1,yz = {2,"npc458",2},yd = {1,"狂啸绝壁",458,35,35},jl = {wp = {{"1元真实充值",1}} } },
                { "天妖山脉-五行混沌体",1,yz = {2,"npc459",2},yd = {1,"血兽战吼山巅",459,51,368},jl = {wp = {{"1元真实充值",1}} } },
                { "天妖山脉-修行之路",1,yz = {1,"npc460",2},yd = {1,"妖骨盘涡毒息林",460,130,283},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"副装箱子",10},{"1元真实充值",5}}}
            },
            {
                { "完成五大陆转生",12,{5},yd = {1,"天玄界",143,39,45},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>完成五大陆转生\\(<提升核心属性/FCOLOR=250>)" },
                { "圣墟秘境-圣虚秘宝",1,yz = {1,"npc462",2},yd = {1,"圣墟秘境",462,30,28},jl = {wp = {{"1元真实充值",1}} } },
                { "圣墟秘境-神之恩赐",1,yz = {2,"npc463",2},yd = {1,"圣者归途",463,30,32},jl = {wp = {{"1元真实充值",1}} } },
                { "圣墟秘境-圣虚之主",1,yz = {2,"npc464",2},yd = {1,"光焰引路泉影照",464,251,272},jl = {wp = {{"1元真实充值",1}} } },
                { "圣墟秘境-兵神天狼",1,yz = {1,"npc465",2},yd = {1,"黄金遗冢",465,22,77},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1000000,"绑定元宝"},{4,100000,"绑定灵符"}},wp = {{"龙纹铜钱",4},{"1元真实充值",5}}}
            },
        },
        {

        },
        {
            {"幽冥邪宗","无尘"},
            {"边境之城","逐浪"},
            {"无尽深渊","追云"},
            {"仙府遗迹","苍狼"},
            {"天妖山脉","孤鸿"},
            {"圣墟秘境","焚息"},
            {"千目凝视之谷","归墟"},
            {"铁壁营寨烽火天","映月"},
            {"血肉风暴裂魂隙","霜魄"},
            {"星陨回响天幕影","风吟"},
            {"妖骨盘涡毒息林","墨影"},
            {"黄金遗冢","锁鳞"},
        },
        {
            {"血池溅月","霜之哀伤"},
            {"狼烟起","熱翔"},
            {"黑渊幽径","致命节奏"},
            {"仙池碧玉","玄武震天尊"},
            {"狂啸绝壁","无情铁御"},
            {"圣者归途","褪色者"},
            {"邪影噬魂坛","七日杀"},
            {"孤军守残垒","长生"},
            {"深海无声谷","狱門疆"},
            {"莲灯未冷时","伏魔御厨子"},
            {"血兽战吼山巅","嵌合暗翳庭"},
            {"光焰引路泉影照","诛伏赐死"},

        }
    },
    {
        {

        },
        {
            {
                { "迷城幻境-迷城秘宝",1,yz = {1,"npc467",2},yd = {1,"迷城幻境",467,62,66},jl = {wp = {{"1元真实充值",1}} } },
                { "迷城幻境-破妄之瞳",1,yz = {1,"npc468",2},yd = {1,"影火幽街",468,170,160},jl = {wp = {{"1元真实充值",1}} } },
                { "迷城幻境-迷城雾鬼",1,yz = {2,"npc469",2},yd = {1,"虚实难辨馆中影",469,140,174},jl = {wp = {{"1元真实充值",1}} } },
                { "迷城幻境-肉就完了",1,yz = {1,"npc470",2},yd = {1,"星屑回廊",470,67,219},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
            {
                { "隐仙居",7,yz = {0,"仙气之体"},yd = {1,"北境仙域",102,44,37},jl = {wp = {{"1元真实充值",1}} },desc = "在隐仙居中完成仙气转换\\(<将灵气转换为仙气/FCOLOR=250>)" },
                { "战歌要塞-要塞寻宝",1,yz = {1,"npc472",2},yd = {1,"战歌要塞",472,103,29},jl = {wp = {{"1元真实充值",1}} } },
                { "战歌要塞-战歌试炼",1,yz = {2,"npc473",2},yd = {1,"战鼓不息",473,28,186},jl = {wp = {{"1元真实充值",1}} } },
                { "战歌要塞-灵星起源",1,yz = {2,"npc474",2},yd = {1,"铁狮门楼风中望",474,14,30},jl = {wp = {{"1元真实充值",1}} } },
                { "战歌要塞-复仇的怒火",1,yz = {2,"npc475",2},yd = {1,"赤焰兵坊",475,209,228},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
            {
                { "斗笠强化",2,yz = {13,21108}, yd = {4,100,159,0,0},jl = {wp = {{"1元真实充值",1}} } ,desc = "斗笠强化至LV20\\(<提升核心属性/FCOLOR=250>)" },
                { "荒古战场-战场寻宝",1,yz = {1,"npc477",2},yd = {1,"荒古战场",477,249,22},jl = {wp = {{"1元真实充值",1}} } },
                { "荒古战场-荒古夺魁",1,yz = {2,"npc478",2},yd = {1,"血腥废墟",478,165,198},jl = {wp = {{"1元真实充值",1}} } },
                { "荒古战场-战场杀神",1,yz = {2,"npc479",2},yd = {1,"废土遗址",479,165,199},jl = {wp = {{"1元真实充值",1}} } },
                { "荒古战场-荒古战神令",1,yz = {1,"npc480",2},yd = {1,"英雄遗墟",480,356,341},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
            {
                { "护体罡气",7,yz = {0,"护体罡气"}, yd = {1,"北境仙域",79,47,37},jl = {wp = {{"1元真实充值",1}} } ,desc = "护体罡气强化至LV20\\(<提升核心属性/FCOLOR=250>)" },
                { "魁族蛮荒-蛮荒寻宝",1,yz = {1,"npc483",2},yd = {1,"魁族蛮荒",483,42,58},jl = {wp = {{"1元真实充值",1}} } },
                { "魁族蛮荒-平定蛮荒",1,yz = {2,"npc484",2},yd = {1,"蛮骨平原",484,25,91},jl = {wp = {{"1元真实充值",1}} } },
                { "魁族蛮荒-攻魔道",1,yz = {2,"npc485",2},yd = {1,"血牙山脉",485,38,141},jl = {wp = {{"1元真实充值",1}} } },
                { "魁族蛮荒-魁族谜题",1,yz = {2,"npc486",2},yd = {1,"荒灵沼泽",486,34,257},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
            {
                { "职业二觉",999,{3,3047}, yd = {1,"北境仙域",177,51,37},jl = {wp = {{"1元真实充值",1}} } ,desc = "职业二觉\\(<可以习得新的职业技能/FCOLOR=250>)" },
                { "苍穹之域-苍穹寻宝",1,yz = {1,"npc489",2},yd = {1,"苍穹之域",489,51,45},jl = {wp = {{"1元真实充值",1}} } },
                { "苍穹之域-苍穹神树",1,yz = {2,"npc490",2},yd = {1,"云阙天宫",490,48,357},jl = {wp = {{"1元真实充值",1}} } },
                { "苍穹之域-美味的菜肴",1,yz = {1,"npc491",2},yd = {1,"星轮天池",491,52,359},jl = {wp = {{"1元真实充值",1}} } },
                { "苍穹之域-苍穹水晶",1,yz = {2,"npc492",2},yd = {1,"玄霄浮岛",492,26,39},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
            {
                { "仙道赐福",7,yz = {0,"仙道赐福"}, yd = {1,"北境仙域",110,63,49},jl = {wp = {{"1元真实充值",1}} } ,desc = "进行50次仙道赐福\\(<获得大量材料和稀有奖励/FCOLOR=250>)" },
                { "混沌荒原-荒原寻宝",1,yz = {1,"npc495",2},yd = {1,"混沌荒原",495,132,60},jl = {wp = {{"1元真实充值",1}} } },
                { "混沌荒原-混沌真龙",1,yz = {1,"npc496",2},yd = {1,"破界荒墟",496,232,254},jl = {wp = {{"1元真实充值",1}} } },
                { "混沌荒原-复仇的怒火",1,yz = {2,"npc497",2},yd = {1,"湮灵断层",497,269,123},jl = {wp = {{"1元真实充值",1}} } },
                { "混沌荒原-不死金刚",1,yz = {1,"npc498",2},yd = {1,"裂魂战渊",498,236,252},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,1500000,"绑定元宝"},{4,150000,"绑定灵符"}},wp = {{"龙纹铜钱",5},{"1元真实充值",6}}}
            },
        },
        {},
        {
            {"迷城幻境","破晓"},
            {"战歌要塞","潜锋"},
            {"荒古战场","飞霞"},
            {"魁族蛮荒","雷渊"},
            {"苍穹之域","玄冥"},
            {"混沌荒原","月痕"},
            {"虚实难辨馆中影","青衿"},
            {"铁狮门楼风中望","风绝"},
            {"废土遗址","烛阴"},
            {"血牙山脉","流岚"},
            {"星轮天池","云渡履"},
            {"湮灵断层","伏龙束"},
        },
        {
            {"影火幽街","暴怒の罪"},
            {"战鼓不息","色欲の罪"},
            {"血腥废墟","贪婪の罪"},
            {"蛮骨平原","傲慢の罪"},
            {"云阙天宫","暴食の罪"},
            {"破界荒墟","嫉妒の罪"},
            {"星屑回廊","怠惰の罪"},
            {"赤焰兵坊","自闭圆顿裹"},
            {"英雄遗墟","轮回之力"},
            {"荒灵沼泽","风王之瞳"},
            {"玄霄浮岛","君焰"},
            {"裂魂战渊","王权"},

        }
    },
    {
        {

        },
        {
            {
                { "切割之斧",2,yz = {12,20400}, yd = {4,100,41,0,0},jl = {wp = {{"1元真实充值",1}} } ,desc = "切割之斧强化至LV35\\(<提升核心属性/FCOLOR=250>)" },
                { "赤焰火洲-赤焰宝藏",1,yz = {1,"npc500",2},yd = {1,"赤焰火洲",500,277,281},jl = {wp = {{"1元真实充值",1}} } },
                { "赤焰火洲-炽焰之力",1,yz = {2,"npc501",2},yd = {1,"炎心古原",501,239,259},jl = {wp = {{"1元真实充值",1}} } },
                { "赤焰火洲-火焰之花",1,yz = {1,"npc502",2},yd = {1,"焰火炼狱",502,25,22},jl = {wp = {{"1元真实充值",1}} } },
                { "赤焰火洲-我全都要",1,yz = {2,"npc503",2},yd = {1,"燎原赤林",503,70,71},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
            {
                { "职业觉醒",8,yd = {1,"中央仙域",178,18,17},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>完成职业三觉\\(<激活三觉技能/FCOLOR=250>)" },
                { "海蓝天岛-天岛宝藏",1,yz = {1,"npc505",2},yd = {1,"海蓝天岛",505,87,61},jl = {wp = {{"1元真实充值",1}} } },
                { "海蓝天岛-阴阳双生",1,yz = {1,"npc506",2},yd = {1,"澜光浅湾",506,74,85},jl = {wp = {{"1元真实充值",1}} } },
                { "海蓝天岛-踏碎山河",1,yz = {2,"npc507",2},yd = {1,"云汐悬崖",507,91,189},jl = {wp = {{"1元真实充值",1}} } },
                { "海蓝天岛-突出重围",1,yz = {2,"npc508",2},yd = {1,"天镜湖心",508,93,300},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
            {
                { "群切强化",9,yd = {4,100,58,0,0},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>群切强化至LV20\\(<大幅提高打怪速度/FCOLOR=250>)" },
                { "禁忌之森-禁忌宝藏",1,yz = {1,"npc511",2},yd = {1,"禁忌之森",511,277,125},jl = {wp = {{"1元真实充值",1}} } },
                { "禁忌之森-百转轮回",1,yz = {2,"npc512",2},yd = {1,"幽藤迷径",512,212,195},jl = {wp = {{"1元真实充值",1}} } },
                --{ "禁忌之森-藏宝图",1,yz = {2,"npc513",2},yd = {1,"幽冥沼泽",513,39,92},jl = {wp = {{"1元真实充值",1}} } },
                { "禁忌之森-一剑开天",1,yz = {1,"npc514",2},yd = {1,"暗影秘境",514,209,216},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
            {
                { "盾牌强化",2,yz = {16,20121}, yd = {4,100,158,0,0},jl = {wp = {{"1元真实充值",1}} } ,desc = "盾牌强化至LV20\\(<提升核心属性/FCOLOR=250>)" },
                { "鬼嚎深渊-深渊寻宝",1,yz = {1,"npc517",2},yd = {1,"鬼嚎深渊",517,346,164},jl = {wp = {{"1元真实充值",1}} } },
                { "鬼嚎深渊-打碎枷锁",1,yz = {2,"npc518",2},yd = {1,"哀魂断口",518,302,37},jl = {wp = {{"1元真实充值",1}} } },
                { "鬼嚎深渊-荣誉之战",1,yz = {2,"npc519",2},yd = {1,"魍魉幽道",519,373,72},jl = {wp = {{"1元真实充值",1}} } },
                { "鬼嚎深渊-无极老人",1,yz = {2,"npc520",2},yd = {1,"死域祭坛",520,100,276},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
            {
                { "仙气萃取",999,{3,3049}, yd = {1,"中央仙域",170,21,17},jl = {wp = {{"1元真实充值",1}} } ,desc = "查看仙气萃取\\(<可以兑换仙气/FCOLOR=250>)" },

                { "无相领域-无相宝藏",1,yz = {1,"npc523",2},yd = {1,"无相领域",523,256,35},jl = {wp = {{"1元真实充值",1}} } },
                { "无相领域-祭拜苍天",1,yz = {2,"npc524",2},yd = {1,"虚轮镜界",524,273,245},jl = {wp = {{"1元真实充值",1}} } },
                { "无相领域-黄鹤归去",1,yz = {2,"npc525",2},yd = {1,"虚幻迷宫",525,264,251},jl = {wp = {{"1元真实充值",1}} } },
                { "无相领域-一诺千金",1,yz = {2,"npc526",2},yd = {1,"意识荒原",526,279,20},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
            {
                { "完成七大陆转生",12,{7},yd = {1,"中央仙域",162,19,22},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>完成七大陆转生\\(<提升核心属性/FCOLOR=250>)" },

                { "诡异裂缝-神魔惧我",1,yz = {1,"npc529",30},yd = {1,"诡异裂缝",529,122,58},jl = {wp = {{"1元真实充值",1}} } },
                { "诡异裂缝-夺命诡气",1,yz = {1,"npc527",2},yd = {1,"灵觉浮域",527,259,35},jl = {wp = {{"1元真实充值",1}} } },
                { "诡异裂缝-诡异之主",1,yz = {2,"npc528",2},yd = {1,"无名之殿",528,206,196},jl = {wp = {{"1元真实充值",1}} } },
                { "诡异裂缝-猩红之主",1,yz = {2,"npc522",2},yd = {1,"血腥深渊",522,79,177},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,2000000,"绑定元宝"},{4,200000,"绑定灵符"}},wp = {{"龙纹铜钱",10},{"1元真实充值",10}}}
            },
        },
        {},
        {

            {"赤焰火洲","夜魇天冕"},
            {"海蓝天岛","流光仙索"},
            {"禁忌之森","断情遗世"},
            {"鬼嚎深渊","浮生梦痕"},
            {"无相领域","鸿蒙初启"},
            {"诡异裂缝","青冥幻影"},
            {"焰火炼狱","玄羽乘风"},
            {"云汐悬崖","锁天紫绦"},
            {"幽冥沼泽","裂星玄盔"},
            {"魍魉幽道","曜天灵珑"},
            {"虚幻迷宫","风云浩劫"},
            {"无名之殿","寂灭苍穹"},
        },
        {
            {"炎心古原","*归墟*"},
            {"澜光浅湾","湿婆业舞"},
            {"幽藤迷径","血系结罗"},
            {"哀魂断口","不朽"},
            {"虚轮镜界","黑日"},
            {"灵觉浮域","黑炎牢狱"},
            {"燎原赤林","血の恩赐"},
            {"天镜湖心","尼德霍格"},
            {"暗影秘境","耶梦加得"},
            {"死域祭坛","旧日支配者"},
            {"意识荒原","流明"},
            {"血腥深渊","死之藤蔓"},

        }
    },
    {
        {

        },
        {
            {
                { "魂卡激活",999,{3,3051}, yd = {1,"诡异位面",153,59,57},jl = {wp = {{"1元真实充值",1}} } ,desc = "查看魂卡激活\\(<boss魂卡激活/FCOLOR=250>)" },

                { "夜哭寒泉-猩红之月",1,yz = {1,"npc521",2},yd = {1,"夜哭寒泉",521,203,201},jl = {wp = {{"1元真实充值",1}} } },
                { "夜哭寒泉-女娲的试炼",1,yz = {2,"npc515",2},yd = {1,"死亡古洞",515,87,323},jl = {wp = {{"1元真实充值",1}} } },
                { "夜哭寒泉-禁忌之主",1,yz = {2,"npc516",2},yd = {1,"月光禁地",516,37,39},jl = {wp = {{"1元真实充值",1}} } },
                { "夜哭寒泉-海蓝之主",1,yz = {2,"npc510",2},yd = {1,"飓涛涌境",510,345,240},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}
            },
            {
                { "职业升华",10,yd = {1,"诡异位面",173,69,63},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>职业升华\\(<职业的最强形态/FCOLOR=250>)" },

                { "蓝珊瑚林-蚩尤的试炼",1,yz = {2,"npc509",2 },yd = {1,"蓝珊瑚林",509,80,134},jl = {wp = {{"1元真实充值",1}} } },
                { "蓝珊瑚林-他好像一条狗",1,yz = {2,"npc504",2 },yd = {1,"赤光熔坛",504,72,88},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}
            },
            {
                { "苍雷裂境-苍穹猎魔使",1,yz = {2,"npc493",2 },yd = {1,"苍雷裂境",493,23,27},jl = {wp = {{"1元真实充值",1}} } },
                { "苍雷裂境-我有一剑",1,yz = {2,"npc494",2 },yd = {1,"寂寥虚穹",494,40,254},jl = {wp = {{"1元真实充值",1}} } },
                { "苍雷裂境-世人皆笑我",1,yz = {2,"npc499",2 },yd = {1,"渊炎绝地",499,465,236},jl = {wp = {{"1元真实充值",1}} } },
                { "苍雷裂境-荒古之谜",1,yz = {1,"npc488",2 },yd = {1,"蛮神遗坛",488,45,35},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}
            },
            {
                { "归去来兮",1,yz = {2,"npc481",2 },yd = {1,"古代战堡",481,373,363},jl = {wp = {{"1元真实充值",1}} } },
                { "荒古密钥",1,yz = {2,"npc482",2 },yd = {1,"雷霆断崖",482,26,220},jl = {wp = {{"1元真实充值",1}} } },
                { "战意凭风起",1,yz = {2,"npc476",2 },yd = {1,"血焰石阵染疆场",476,44,28},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}

            },
            {
                { "肃清迷城",1,yz = {2,"npc471",2 },yd = {1,"幻纹石径迷途归",471,270,33},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}

            },
            {
                { "完成八大陆转生",12,{8},yd = {1,"诡异位面",163,59,63},jl = {wp = {{"1元真实充值",1}} },desc = "<核心/FCOLOR=249>完成八大陆转生\\(<提升核心属性/FCOLOR=250>)" },

                { "圣虚斩魔",1,yz = {2,"npc466",2 },yd = {1,"天启之门",466,42,85},jl = {wp = {{"1元真实充值",1}} } },
                { "掀翻它们",1,yz = {2,"npc461",2 },yd = {1,"万蛇洞窟",461,22,267},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,3000000,"绑定元宝"},{4,300000,"绑定灵符"}},wp = {{"龙纹铜钱",15},{"1元真实充值",15}}}
            },
        },
        {},
        {
            {"夜哭寒泉","寂影孤魂"},
            {"蓝珊瑚林","长歌踏月"},
            {"苍雷裂境","九霄游风"},
            {"古代战堡","封魔镇狱"},
            {"幽梦之庭","炎凰冕盔"},
            {"天启之门","炽焰珠链"},
            {"月光禁地","火种之戒"},
            {"赤日神殿","赤焰戒"},
            {"渊炎绝地","火舞手镯"},
            {"血焰石阵染疆场","熔岩手镯"},
            {"梦魇之核噩梦醒","烈风之履"},
            {"万蛇洞窟","火龙束带"},
        },
        {
            {"死亡古洞","星空·道极"},
            {"赤光熔坛","命运之轮"},
            {"寂寥虚穹","弑序亲王"},
            {"雷霆断崖","特修斯の魔"},
            {"幻纹石径迷途归","王之蔑视"},
            {"幻沙古径","午夜虹吸"},
            {"飓涛涌境","世界树灵枝"},
            {"初劫之痕","流水无情"},
            {"蛮神遗坛","落花三千"},
            {"战士归骨","烟雨醉浮生"},
            {"圣血石林孤塔声","此上无人1"},
            {"巨爪绝崖魂断坠","此下众生1"},

        }
    },
    {
        {

        },
        {
            {
                { "清理门户",1,yz = {2,"npc456" ,2},yd = {1,"风雷禁阁",456,207,93},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}
            },
            {
                { "深渊之主",1,yz = {2,"npc451" ,2},yd = {1,"迷影石廊",451,25,72},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}

            },
            {
                { "我要这天",1,yz = {2,"npc446" ,2},yd = {1,"风沙埋骨镇",446,15,98},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}


            },
            {
                { "嗜血杀戮",1,yz = {2,"npc441" ,2},yd = {1,"幽火燃骨坛",441,59,289},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}


            },
            {
                { "妖魔作乱",1,yz = {2,"npc435" ,2},yd = {1,"白峰古道",435,359,44},jl = {wp = {{"1元真实充值",1}} } },
                { "初识虚渊界",1,yz = {1,"npc436" ,2},yd = {1,"凌云冰谷",436,185,208},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}

            },
            {

                { "杀戮舞曲",1,yz = {2,"npc429" ,2},yd = {1,"诡音回廊",429,44,44},jl = {wp = {{"1元真实充值",1}} } },
                { "证明自我",1,yz = {1,"npc430" ,2},yd = {1,"迷魂秘径",430,23,215},jl = {wp = {{"1元真实充值",1}} } },
                jl = {hb = {{3,5000000,"绑定元宝"},{4,500000,"绑定灵符"}},wp = {{"龙纹铜钱",20},{"1元真实充值",20}}}

            }
        },
        {},
        {
            {"獠牙石道","星辰冕冠"},
            {"灵虚之塔","无影梦链"},
            {"禁忌裂隙","冥炎之戒"},
            {"旧城血染街","破碎轮回"},
            {"黑棺地宫","幽灵步履"},
            {"诡音回廊","惊雷踏云"},
            {"风雷禁阁","疾风追星"},
            {"迷影石廊","九重苍带"},
            {"风沙埋骨镇","紫电"},
            {"幽火燃骨坛","幻梦池"},
            {"白峰古道","苍穹"},
            {"阴火祭坛","血焰"},
            {"黄泉尽头石门","寒夜霜"},
            {"凌云冰谷","雪影舞"},
            {"星陨之境","流云山"},
        }
    },
}
npc[11] = function(play,p2,p3,data)  --异闻录
    if p2 == 0 then
        if not Player.dl_sz_notip(play, 2) then
            sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>完成一大陆任务后开启。。。</font>","Type":9}')
            return false
        end
        sendluamsg(play, 101, 11, 0, 0,
                '{"dljq":'..getplaydef(play, VarCfg.T_dljq)
                        ..',"zxrw":'..getplaydef(play, VarCfg.T_zxrw)
                        ..',"ywl":'..getplaydef(play, VarCfg.T_ywl)
                        ..',"T_tj":'..getplaydef(play,VarCfg.T_tj)
                        ..'}')
    elseif p2 == 1 then --传送
        local sj = json2tbl(data)
        if sj.i and sj.k and sj.j and sj.z and sj.i > 0 and sj.k > 0 and sj.j > 0 and sj.z > 0 and sj.i <= #npc_xyl and sj.j <= #npc_xyl[sj.i] and sj.k <= #npc_xyl[sj.i][sj.j] and sj.z <= #npc_xyl[sj.i][sj.j][sj.k] then
            if Player.dl_sz_notip(play, sj.i) then
                local shuju = npc_xyl[sj.i][sj.j][sj.k][sj.z]
                if shuju[2] == 999 and sj.i > 3 then
                    local T_ywl = json2tbl(getplaydef(play,VarCfg.T_ywl))
                    if not (T_ywl["rw_"..shuju[3][2]] and T_ywl["rw_"..shuju[3][2]] == 1) then
                        Player.zxrw_lingqu(play, shuju[3][2], "")
                    end
                end
                if shuju.yd[1] == 0 then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>无法传送...</font>","Type":9}')
                elseif shuju.yd[1] == 1 then
                    if getplaydef(play,"N$战斗状态") < os.time() then
                        mapmove(play,shuju.yd[2],shuju.yd[4],shuju.yd[5],2)
                        sendluamsg(play, 101, 0, 1, 1,'{"lx":2,"npcdt":"'..shuju.yd[2]..'","npcid":'..shuju.yd[3]..',"xx":'..shuju.yd[4]..',"yy":'..shuju.yd[5]..'}')
                        sendluamsg(play,101,9999,0,0,"npc_ywl")
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
                    end
                elseif shuju.yd[1] == 2 then
                    sendluamsg(play, 101, 0, 1, 1,'{"lx":1,"fx":1,"an":'..shuju.yd[3]..',"ms":"点击按钮"}')
                    sendluamsg(play,101,9999,0,0,"npc_ywl")
                    sendluamsg(play,101,9999,0,0,"npc_ywl")
                elseif shuju.yd[1] == 3 then
                    sendluamsg(play, 101, 0, 1, 1,'{"lx":'..shuju.yd[2]..'}')
                    sendluamsg(play,101,9999,0,0,"npc_ywl")
                elseif shuju.yd[1] == 4 then
                    sendluamsg(play,shuju.yd[2],shuju.yd[3],shuju.yd[4],0,"")
                    sendluamsg(play,101,9999,0,0,"npc_ywl")
                end
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>条件不足,无法传送...</font>","Type":9}')
            end
        end
    elseif p2 == 2 then --一页任务奖励
        local sj = json2tbl(data)
        if sj.i and sj.k and sj.j and sj.i > 0 and sj.k > 0 and sj.j > 0 and sj.i <= #npc_xyl and sj.j <= #npc_xyl[sj.i] and sj.k <= #npc_xyl[sj.i][sj.j] then
            local T_ywl = json2tbl(getplaydef(play,VarCfg.T_ywl))
            if T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k] and T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k] == 1 then
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>已领取过了...</font>","Type":9}')
                return
            end
            for i = 1, #npc_xyl[sj.i][sj.j][sj.k] do
                if T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. i] and T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. i] == 1 then
                    T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. i] = nil
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..npc_xyl[sj.i][sj.j][sj.k][i][1]..']剧情...</font>","Type":9}')
                    return
                end
            end
            T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k] = 1
            setplaydef(play, VarCfg.T_ywl, tbl2json(T_ywl))
            Player.rwjl(play,npc_xyl[sj.i][sj.j][sj.k].jl,"剧情jl",nil)
            sendluamsg(play, 101, 11, 3, 0,
                    '{"dljq":'..getplaydef(play, VarCfg.T_dljq)
                            ..',"zxrw":'..getplaydef(play, VarCfg.T_zxrw)
                            ..',"ywl":'..getplaydef(play, VarCfg.T_ywl)
                            ..',"T_tj":'..getplaydef(play,VarCfg.T_tj)
                            ..'}')
            if (sj.i == 2 or sj.i == 3) and sj.k < 6 then
                for i = 1, #npc_xyl[sj.i][sj.j][sj.k + 1] do
                    if npc_xyl[sj.i][sj.j][sj.k + 1][i][2] == 999 and (npc_xyl[sj.i][sj.j][sj.k + 1][i][3][1] == 3 or npc_xyl[sj.i][sj.j][sj.k + 1][i][3][1] == 4) then
                        Player.zxrw_lingqu(play, npc_xyl[sj.i][sj.j][sj.k + 1][i][3][2], "")
                    end
                end
            elseif sj.i == 2 and sj.k == 6 then
                for i = 1, #npc_xyl[3][sj.j][1] do
                    if npc_xyl[3][sj.j][1][i][2] == 999 and (npc_xyl[3][sj.j][1][i][3][1] == 3 or npc_xyl[3][sj.j][1][i][3][1] == 4) then
                        Player.zxrw_lingqu(play, npc_xyl[3][sj.j][1][i][3][2], "")
                    end
                end
                sendluamsg(play, 101, 9999, 0, 0, "npc_ywl")
                mapmove(play, "剑门外门", 98, 84,1) --剑门外门
                sendluamsg(play, 101, 0, 1, 1,'{"lx":2,"npcdt":"'.."剑门外门"..'","npcid":'.. 132 ..',"xx":'.. 97 ..',"yy":'.. 85 ..'}')
            elseif sj.i == 3 and sj.k == 6 then
                sendluamsg(play, 101, 9999, 0, 0, "npc_ywl")
                mapmove(play, "剑门内门", 95, 129,1) --剑门内门
                sendluamsg(play, 101, 0, 1, 1,'{"lx":2,"npcdt":"'.."剑门内门"..'","npcid":'.. 37 ..',"xx":'.. 93 ..',"yy":'.. 131 ..'}')
            end
        end
    elseif p2 == 3 then --单个任务奖励
        local sj = json2tbl(data)
        if sj.i and sj.k and sj.j and sj.z and sj.i > 0 and sj.k > 0 and sj.j > 0 and sj.z > 0 and sj.i <= #npc_xyl and sj.j <= #npc_xyl[sj.i] and sj.k <= #npc_xyl[sj.i][sj.j] and sj.z <= #npc_xyl[sj.i][sj.j][sj.k] then
            local shuju = npc_xyl[sj.i][sj.j][sj.k][sj.z]
            local T_dljq = json2tbl(getplaydef(play,VarCfg.T_dljq))
            local T_ywl = json2tbl(getplaydef(play,VarCfg.T_ywl))
            if (T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k] and T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k] == 1) or (T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. sj.z] and T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. sj.z] == 1) then
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>已完成['..shuju[1]..']剧情...</font>","Type":9}')
                return
            end
            if (sj.i == 2 or sj.i == 3) and sj.k > 1 then
                if not (T_ywl["jl_"..sj.i.."_"..sj.j.."_"..(sj.k - 1)] and T_ywl["jl_"..sj.i.."_"..sj.j.."_"..(sj.k - 1)] == 1) then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>请先完成前一章节任务...</font>","Type":9}')
                    return
                end
            end
            if shuju[2] == 999 then
                if shuju[3][1] == 3 or shuju[3][1] == 4 then
                    if not (T_ywl["rw_"..shuju[3][2]] and T_ywl["rw_"..shuju[3][2]] == 1) then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                        return
                    end
                end
            elseif shuju[2] == 1 then
                local yzType, yzKey, yzValue = shuju.yz[1], shuju.yz[2], shuju.yz[3]
                local canClaim = (yzType == 1 and T_dljq[yzKey] and T_dljq[yzKey] >= yzValue)
                        or (yzType == 2 and T_dljq[yzKey] and T_dljq[yzKey][1] >= yzValue)

               if not canClaim then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 2 then
                local item = linkbodyitem(play,shuju.yz[1])
                if not (item == "0") then
                    local idx = getiteminfo(play,item,2)
                    if idx < shuju.yz[2] then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                        return
                    end
                end
            elseif shuju[2] == 3 then --完成职业一觉
                local T_zzsj = json2tbl(getplaydef(play,VarCfg.T_zzsj))
                if T_zzsj.dqzy and T_zzsj.one_jue and T_zzsj.one_jue[""..T_zzsj.dqzy] and T_zzsj.one_jue[""..T_zzsj.dqzy] == 1 then
                    --已完成一觉
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 4 then --激活群切强化
                local item = linkbodyitem(play,104)
                if not (item == "0") then
                    local sx = json2tbl(getitemcustomabil(play, item))
                    local dj = sx.abil[constant.kmlw.attr[1][1] + 1].v[constant.kmlw.attr[1][2] + 1][3] / constant.kmlw.attr[1][3]
                    if not (dj > 0) then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                        return
                    end
                end
            elseif shuju[2] == 5 then --职业强化至LV100
                local T_zzsj = json2tbl(getplaydef(play,VarCfg.T_zzsj))
                if T_zzsj.dqzy and T_zzsj.zy_dj and T_zzsj.zy_dj[""..T_zzsj.dqzy] and T_zzsj.zy_dj[""..T_zzsj.dqzy] >= 100 then
                    --已完成一觉
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 6 then --2觉
                local T_zzsj = json2tbl(getplaydef(play,VarCfg.T_zzsj))
                if T_zzsj.dqzy and T_zzsj.two_jue and T_zzsj.two_jue[""..T_zzsj.dqzy] and T_zzsj.two_jue[""..T_zzsj.dqzy] == 1 then
                    --已完成一觉
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 7 then --称号检测类
                if checktitle(play, shuju.yz[2]) then
                    --已完成称号
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 8 then --三绝
                local T_zzsj = json2tbl(getplaydef(play,VarCfg.T_zzsj))
                if T_zzsj.dqzy and T_zzsj.three_jue and T_zzsj.three_jue[""..T_zzsj.dqzy] and T_zzsj.three_jue[""..T_zzsj.dqzy] == 1 then
                    --已完成一觉
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 9 then --激活群切强化 -20
                local item = linkbodyitem(play,104)
                if not (item == "0") then
                    local sx = json2tbl(getitemcustomabil(play, item))
                    local dj = sx.abil[constant.kmlw.attr[1][1] + 1].v[constant.kmlw.attr[1][2] + 1][3] / constant.kmlw.attr[1][3]
                    if not (dj >= 20) then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                        return
                    end
                end
            elseif shuju[2] == 10 then --三绝
                local T_zzsj = json2tbl(getplaydef(play,VarCfg.T_zzsj))
                if T_zzsj.dqzy and T_zzsj.sh and T_zzsj.sh[""..T_zzsj.dqzy] and T_zzsj.sh[""..T_zzsj.dqzy] == 1 then
                    --已完成一觉
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 11 then --惊门10
                local item = linkbodyitem(play,72)
                local sx = json2tbl(getitemcustomabil(play, item))
                local dj = sx.abil[1 + 1].v[5 + 1][3]
                if not (dj >= 1000) then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            elseif shuju[2] == 12 then --转生相关
                if getbaseinfo(play,39) < shuju[3][1] then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>未完成['..shuju[1]..']剧情...</font>","Type":9}')
                    return
                end
            end
            T_ywl["jl_"..sj.i.."_".. sj.j .."_"..sj.k .."_" .. sj.z] = 1
            setplaydef(play, VarCfg.T_ywl, tbl2json(T_ywl))
            if shuju.jl then
                Player.rwjl(play,shuju.jl,"剧情jl",nil)
            end
            sendluamsg(play, 101, 11, 0, 0,
                    '{"dljq":'..getplaydef(play, VarCfg.T_dljq)
                            ..',"zxrw":'..getplaydef(play, VarCfg.T_zxrw)
                            ..',"ywl":'..getplaydef(play, VarCfg.T_ywl)
                            ..',"T_tj":'..getplaydef(play,VarCfg.T_tj)
                            ..'}')
        end
    elseif p2 == 4 then --一整个大陆任务奖励
    elseif p2 == 5 then --专属追踪
        local sj = json2tbl(data)
        if sj.i and sj.k and sj.i > 0 and sj.k > 0 and sj.i <= #npc_xyl and sj.k <= #npc_xyl[sj.i][4] then
            if Player.dl_sz_notip(play, sj.i) then
                local shuju = npc_xyl[sj.i][4][sj.k]
                if shuju[3] and shuju[3][1] == 0 then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>无法传送...</font>","Type":9}')
                else
                    if shuju.jcch and not checktitle(play, shuju.jcch) then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>需要称号：['..shuju.jcch..']，您没有完成前置的任务...</font>","Type":9}')
                        return
                    end
                    if getplaydef(play,"N$战斗状态") < os.time() then
                        map(play,shuju[1])
                        sendluamsg(play,101,9999,0,0,"npc_ywl")
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
                    end
                end
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>条件不足,无法传送...</font>","Type":9}')
            end
        end
    elseif p2 == 6 then --专属追踪
        local sj = json2tbl(data)
        if sj.i and sj.k and sj.i > 0 and sj.k > 0 and sj.i <= #npc_xyl and sj.k <= #npc_xyl[sj.i][4] then
            if Player.dl_sz_notip(play, sj.i) and npc_xyl[sj.i][5] then
                local shuju = npc_xyl[sj.i][5][sj.k]
                if shuju[3] and shuju[3][1] == 0 then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>无法传送...</font>","Type":9}')
                else
                    if shuju.jcch and not checktitle(play, shuju.jcch) then
                        sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>需要称号：['..shuju.jcch..']，您没有完成前置的任务...</font>","Type":9}')
                        return
                    end
                    if getplaydef(play,"N$战斗状态") < os.time() then
                        map(play,shuju[1])
                        sendluamsg(play,101,9999,0,0,"npc_ywl")
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
                    end
                end
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>条件不足,无法传送...</font>","Type":9}')
            end
        end
    end
end
---记忆传送
npc[13] = function(play, p2, p3, data)  -- 记录石
    if p2 == 0 then
        -- 当 p3 为 0 时，进行记录石的初始化操作
        -- 向客户端发送消息，请求获取玩家的默认记录石信息
        sendluamsg(play, 101, 13, 1, 0, getplaydef(play, VarCfg.T_jls))
    elseif p2 == 1 then

        -- 当 p3 为 1 时，记录
        local jls = json2tbl(getplaydef(play,VarCfg.T_jls))
        --获取当前玩家坐标和地图
        local xx,yy,dt = getbaseinfo(play,4),getbaseinfo(play,5),getbaseinfo(play,3)
        if string.find(dt,"_") then
            --向客户端发送消息，通知玩家处于副本地图，无法记录
            sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>副本地图无法记录...</font>","Type":9}')
            return
        elseif checkkuafu(play) or jinzhigj[dt] then
            --向客户端发送消息，通知玩家处于禁止记录的地图，无法记录
            sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>当前地图无法记录...</font>","Type":9}')
            return
        end
        --将当前玩家的坐标和地图信息存入记录石信息中
        jls["dtm"..p3] = {p3,dt,xx,yy}
        --将记录石信息存入玩家的数据中
        setplaydef(play,VarCfg.T_jls,tbl2json(jls))
        --向客户端发送消息，通知记录石记录成功
        sendluamsg(play, 101, 13, 2, p3, getplaydef(play, VarCfg.T_jls))
    elseif p2 == 2 then
        -- 当 p2 为 2 时，进行记录石的传送
        local jls = json2tbl(getplaydef(play,VarCfg.T_jls))
        --获取当前玩家的记录石信息
        local jlsinfo = jls["dtm"..p3]
        --判断记录石信息是否存在
        if jlsinfo then
            --判断当前玩家是否处于战斗状态
            if getplaydef(play,"N$战斗状态") < os.time() then
                --是不是有足够的仙玉
                if getbindmoney(play,"仙玉") < 100 then
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff0500\'>仙玉不足,无法传送...</font>","Type":9}')
                    return
                end
                consumebindmoney(play,"仙玉",100)
                --传送玩家到记录石的位置
                mapmove(play,jlsinfo[2],jlsinfo[3],jlsinfo[4],2)
                --向客户端发送消息，通知传送成功
                sendluamsg(play, 101, 13, 3, p3, "")
            else
                --向客户端发送消息，通知玩家处于战斗状态，无法传送
                sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
            end
        else
            --向客户端发送消息，通知记录石不存在
            sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>记录石不存在...</font>","Type":9}')
        end
    end
end
---实力提升
npc[17] = function(play, p2, p3, data)  --实力提升
    if p2 == 0 then  --实力提升  --初始化页面
        sendluamsg(play, 101, 17, 0, 0, "")
    end
end
---首充礼包
npc[501] = function(play,p2,p3,data)  --首充礼包
    if p3 == 0 then
        sendluamsg(play, 101, 501, 0, 0,getflagstatus(play,VarCfg.BS_sckg))
    elseif p3 == 1 then
        if querymoney(play,20) >= 10 then
            if getflagstatus(play,VarCfg.BS_sckg) == 0 then
                setflagstatus(play,VarCfg.BS_sckg,1)
                local json = json2tbl(getplaydef(play,VarCfg.T_czlb))
                json["sclb"] = true
                setplaydef(play,VarCfg.T_czlb,tbl2json(json))
                sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[首充礼包]</font><font color=\'#28ef01\'>领取首充礼包成功!</font>","Type":9}')
                sendluamsg(play, 101, 501, 0, 1,"")
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[首充礼包]</font><font color=\'#ff0500\'>已经领取过了,无法重复领取...</font>","Type":9}')
            end
        else
            sendluamsg(play, 101, 999, 10, 7,"")
        end
    end
end
---在线充值
npc[502] = function(play,p2,p3,data)  --在线充值
    if p3 == 0 then
        sendluamsg(play, 101, 502, 0, 0,getplaydef(play,VarCfg.T_czlb))
    elseif p3 == 2 then
        local je = tonumber(data)
        if je and constant.cz_jeyz[je] then
            setplaydef(play,VarCfg.U_czyz,constant.cz_jeyz[je])
            sendluamsg(play, 101, 999, je, 7,"")
        end
    elseif p3 == 3 then
        local je = tonumber(data)
        if je and je >= 10 then
            setplaydef(play,VarCfg.U_czyz,0)
            sendluamsg(play, 101, 999, je, 7,"")
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff0500\'>充值金额不得小于10元...</font>","Type":9}')
        end
    elseif p3 == 4 then
        local json = json2tbl(getplaydef(play,VarCfg.T_czlb))
        if json.cz4 then
            if json.jskg then
                json.jskg = nil
                Buff[94](play,2)
                sendmsg(play,1,'{"Msg":"<font color=\'#ff0500\'>溅射功能已关闭...</font>","Type":9}')
            else
                Buff[94](play,1)
                json.jskg = true
                sendmsg(play,1,'{"Msg":"<font color=\'#28ef01\'>溅射功能已开启...</font>","Type":9}')
            end
            setplaydef(play,VarCfg.T_czlb,tbl2json(json))
        end
    end
end
---赞助礼包
local zzch,sg,qsx = {"黄金赞助","铂金赞助","钻石赞助"},{0,50,100},{1,2,3}
npc[503] = function(play,p2,p3,data)  --赞助礼包
    if p2 == 0 then
        sendluamsg(play, 101, 503, 0, getplaydef(play,VarCfg.U_fldt[2]),getplaydef(play,VarCfg.T_czlb))
    elseif p2 == 1 then
        local json = json2tbl(getplaydef(play,VarCfg.T_czlb))
        if not json["zzlb"..p3] then
            if getplaydef(play,VarCfg.U_fldt[2]) >= sg[p3] then
                json["zzlb"..p3] = 1
                setplaydef(play,VarCfg.T_czlb,tbl2json(json))
                sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[赞助礼包]</font><font color=\'#28ef01\'>领取成功...</font>","Type":9}')
                Player.title_give(play,zzch[p3])
                Player.qsx_give(play, qsx[p3], "赞助", nil)
                if getplaydef(play,VarCfg.U_zxrw[1]) == 2 and p3 == 1 then
                    newdeletetask(play,getplaydef(play,VarCfg.U_zxrw[1]))
                    playeffect(play,4011,25,-50,1,0,0)
                    sendluamsg(play, 101, 503, 2, p3,"")
                    return
                end
                if json["zzlb"..1] and json["zzlb"..2] and json["zzlb"..3] then
                    sendluamsg(play, 101, 503, 2, p3,"")
                    return
                end
                sendluamsg(play, 101, 503, 1, p3,"")
            else
                sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[赞助礼包]</font><font color=\'#ff0500\'>当前杀怪数量不足,无法领取...</font>","Type":9}')
                return
            end
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[赞助礼包]</font><font color=\'#ff0500\'>已经领取过礼包了...</font>","Type":9}')
        end
    end
end
---快人一步
npc[504] = function(play,p2,p3,data)  --快人一步
    if p2 == 0 then
        sendluamsg(play, 101, 504, 0, 0,'{"mztq":'..getflagstatus(play,VarCfg.BS_mztq)..',"zjxz":'..getplaydef(play,VarCfg.U_jdgh)..'}')
    elseif p2 == 1 then
        if getflagstatus(play,VarCfg.BS_mztq) == 0 then
            sendluamsg(play, 101, 999, 98, 21,"")
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff0000\'>每人只能购买一次</font>","Type":9}')
        end
    elseif p2 == 2 then
        sendluamsg(play, 101, 504, 2, 0,'{"mztq":'..getflagstatus(play,VarCfg.BS_mztq)..',"zjxz":'..getplaydef(play,VarCfg.U_jdgh)..'}')
    end
end
---自动巡航
npc[505] = function(play,p2,p3,data)  --自动巡航
    if p2 == 0 then
        sendluamsg(play, 101, 505, 0, 0,"")
    elseif p2 == 1 then
        sendluamsg(play, 101, 505, 1, 0,getplaydef(play,VarCfg.T_aigj))
    elseif p2 == 2 then
        local dtmz = getbaseinfo(play,3)
        if jinzhigj[dtmz] or string.find(dtmz,"_") then
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0000\'>当前地图,无法记录...</font>","Type":9}')
        elseif checkkuafu(play) then
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0000\'>跨服地图,无法记录...</font>","Type":9}')
        else
            local json = json2tbl(getplaydef(play,VarCfg.T_aigj))
            json["dt"..p3] = getbaseinfo(play,45)
            json["dtid"..p3] = dtmz
            sendluamsg(play, 101, 505, 2, p3,getbaseinfo(play,45))
            setplaydef(play,VarCfg.T_aigj,tbl2json(json))
        end
    elseif p2 == 3 then
        local json = json2tbl(getplaydef(play,VarCfg.T_aigj))
        if json["fgx"..p3] then
            json["fgx"..p3] = nil
        elseif json["dtid"..p3] then
            json["fgx"..p3] = true
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0500\'>当前未记录地图,无法勾选...</font>","Type":9}')
        end
        setplaydef(play,VarCfg.T_aigj,tbl2json(json))
        sendluamsg(play, 101, 505, 3, p3,getplaydef(play,VarCfg.T_aigj))
    elseif p2 == 4 then
        if getflagstatus(play,VarCfg.BS_18cz) == 1 then
            local json = json2tbl(getplaydef(play,VarCfg.T_aigj))
            if getflagstatus(play,VarCfg.BS_AIgj) == 0 then
                local yz = 0
                for i = 1, 10, 1 do
                    if json["fgx"..i] then
                        yz = 1
                        break
                    end
                end
                if yz == 1 then
                    startautoattack(play)
                    setflagstatus(play,VarCfg.BS_AIgj,1)
                    json.gjkg = true
                    setplaydef(play,VarCfg.N_Aigj[2],os.time())
                    setplaydef(play,VarCfg.N_Aigj[5],os.time())
                    setontimer(play, 5, 1, 0, 1)
                else
                    sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0500\'>未勾选任何地图,无法进行AI挂机...</font>","Type":9}')
                end
            else
                json.gjkg = nil
                stopautoattack(play)
                setflagstatus(play,VarCfg.BS_AIgj,0)
                setofftimer(play,5)
            end
            setplaydef(play,VarCfg.T_aigj,tbl2json(json))
            sendluamsg(play, 101, 505, 4,0,tbl2json(json))
        else
            sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0000\'>未激活【自动巡航】,无法使用，可在在线充值激活...</font>","Type":9}')
        end
    elseif p2 == 5 then
        if getflagstatus(play,VarCfg.BS_18cz) == 1 then
            local json = json2tbl(getplaydef(play,VarCfg.T_aigj))
            if p3 == 1 then
                if json.zgx1 then
                    json.zgx1 = nil
                    Buff[96](play,2)
                else
                    Buff[96](play,1)
                    json.zgx1 = true
                end
            elseif p3 == 2 then
                if json.zgx2 then
                    json.zgx2 = nil
                    shaguai.jian(play,23)
                else
                    shaguai.jia(play,23)
                    json.zgx2 = true
                end
            else
                if json["zgx"..p3] then
                    json["zgx"..p3] = nil
                else
                    json["zgx"..p3] = true
                end
            end
            setplaydef(play,VarCfg.T_aigj,tbl2json(json))
        end
    else
        sendmsg(play,1,'{"Msg":"<font color=\'#ff7700\'>[自动巡航]</font><font color=\'#ff0000\'>未激活【自动巡航】,无法使用，可在在线充值激活...</font>","Type":9}')
    end
end
---天选之人
npc[506] = function(play,p2,p3,msgData)  --天选之子
    if p2 == 0 then
        sendluamsg(play, 101, 506, 0, 0,
                '{"A_txzz":'..(getsysvar(VarCfg["A_天选之人json"]) == "" and "{}" or getsysvar(VarCfg["A_天选之人json"]))..
                        ',"T_txzr":'..getplaydef(play,VarCfg.T_txzr)..
                        ',"kqsj":'..getsysvar(VarCfg["G_开区分钟"])..
                        ',"G_txzz_2":'..getsysvar(VarCfg["G_天选之人时间"][2])..
                        '}')
    end
end

local hd_dtmz = {

}
npc[507] = function(play,p2,p3,msgData)  --游戏活动
    if p2 == 0 then
        sendluamsg(play, 101, 507, 0, 0,
                '{"kqfz":'..getsysvar(VarCfg["G_开区分钟"])..',"hdjl":'..getplaydef(play,VarCfg.T_hdjl)..'}')
    elseif p2 == 1  then

    elseif p2 == 2 then
        if  p3 > 0 and p3 < 4 then
            local kqsj = getsysvar(VarCfg["G_开区分钟"])
            if getplaydef(play,"N$战斗状态") < os.time() then
                if kqsj >= hd_dtmz[1][p3][2] and kqsj < hd_dtmz[1][p3][3] then
                    if p3 == 1 then
                        mapmove(play,"xtc",137,138,7)
                    elseif getbaseinfo(play,3) == hd_dtmz[1][p3][1] then
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>已在活动地图了...</font>","Type":9}')
                    elseif hd_dtmz[1][p3][1] == "比武大会" then
                        mapmove(play,hd_dtmz[1][p3][1],29,29,8)
                        sendluamsg(play,101,9999,0,0,"npc_yxhd")
                    else
                        map(play,hd_dtmz[1][p3][1])
                        sendluamsg(play,101,9999,0,0,"npc_yxhd")
                    end
                    local T_hdcjjl = json2tbl(getplaydef(play,VarCfg.T_hdcjjl))
                    if not T_hdcjjl["2_"..p3] then
                        setplaydef(play,VarCfg.U_hdjf,getplaydef(play,VarCfg.U_hdjf) + 10)
                        T_hdcjjl["2_"..p3] = 1
                        setplaydef(play,VarCfg.T_hdcjjl,tbl2json(T_hdcjjl))
                    end
                    delaymsggoto(play,100,"@Login_msg,1")
                else
                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>不在活动时间内无法传送...</font>","Type":9}')
                end
            else
                sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
            end
        end
    elseif p2 == 3 then
        if p3 > 0 and p3 <= 4 then
            if getplaydef(play,"N$战斗状态") < os.time() then
                if getbaseinfo(play,3) == hd_dtmz[2][p3][1] then
                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>已在活动地图了...</font>","Type":9}')
                else
                    if p3 == 4 then
                        mapmove(play,hd_dtmz[2][p3][1],48,53,8)
                    else
                        map(play,hd_dtmz[2][p3][1])
                    end
                    sendluamsg(play,101,9999,0,0,"npc_yxhd")
                end
                local T_hdcjjl = json2tbl(getplaydef(play,VarCfg.T_hdcjjl))
                if not T_hdcjjl["3_"..p3] then
                    setplaydef(play,VarCfg.U_hdjf,getplaydef(play,VarCfg.U_hdjf) + 10)
                    T_hdcjjl["3_"..p3] = 1
                    setplaydef(play,VarCfg.T_hdcjjl,tbl2json(T_hdcjjl))
                end
                delaymsggoto(play,100,"@Login_msg,1")
            else
                sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>战斗状态无法使用...</font>","Type":9}')
            end
        elseif p3 == 5 then
            if getbaseinfo(play,3) == "阵营对抗" then
                sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>已在活动地图了...</font>","Type":9}')
                return
            end
            if getplaydef(play,VarCfg.J_zydkbs) == 0 then
                if getsysvar(constant.G_zydkbs) == 0 then
                    setplaydef(play,VarCfg.J_zydkbs,1)
                    setsysvar(constant.G_zydkbs,1)
                    mapmove(play,"阵营对抗",33,37,8)
                    setcamp(play,1)
                else
                    setplaydef(play,VarCfg.J_zydkbs,2)
                    setsysvar(constant.G_zydkbs,0)
                    mapmove(play,"阵营对抗",33,37,8)
                    setcamp(play,2)
                end
            else
                if getplaydef(play,VarCfg.J_zydkbs) == 1 then
                    mapmove(play,"阵营对抗",33,37,8)
                    setcamp(play,1)
                elseif getplaydef(play,VarCfg.J_zydkbs) == 2 then
                    mapmove(play,"阵营对抗",33,37,8)
                    setcamp(play,2)
                end
            end
        end
    end
end

---天天省钱
npc[509] = function(play,p2,p3,msgData) openhyperlink(play,111,0) end
---交易行
npc[510] = function(play,p2,p3,msgData) openhyperlink(play,35,0) end

npc[511] = function(play,p2,p3,msgData)  --福利大厅
end

npc[512] = function(play,p2,p3,msgData)  --游戏攻略
    if p2 == 0 then
        sendluamsg(play, 101, 512, 0, 0,"")
    end
end

local xlxl = {{1,2,3,4,7,8,23,22,24,25,26},{18,38,68,128,288,588,888,1188,1588,1888},{98,6,30,198,28,58,88,66,98}}
npc[998] = function(play,p2,p3,msg)  --后台
    local qfmz = getconst(play, '<$SERVERNAME>')
    if getplaydef(play,VarCfg.S_houtaibf) ~= "" or (qfmz == "" or qfmz == "测试区" )then
        if getplaydef(play,VarCfg.S_houtaibf) == "" and (qfmz == "" or qfmz == "测试区" ) then
            setplaydef(play,VarCfg.S_houtaibf,"本地测试区")
        end
        if p2 == 1 then
            if p3 == 0 then
                if getplayerbyname(msg) then
                    sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..msg..']玩家在线</font>","Type":9}')
                else
                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..msg..']玩家不在线</font>","Type":9}')
                end
            elseif p3 == 1 then
                local data = json2tbl(msg)
                if data and data.mz and data.hb and data.hb > 0 and data.hb < 9 then
                    local dx = getplayerbyname(data.mz)
                    if dx then
                        sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.mz..']货币剩余：'..querymoney(dx,xlxl[1][data.hb])..'</font>","Type":9}')
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                    end
                end
            elseif p3 == 2 or p3 == 3 then
                local data = json2tbl(msg)
                if data and data.mz and data.hb and data.hb > 0 and data.hb < 12 and data.sl then
                    local dx = getplayerbyname(data.mz)
                    if dx then
                        local hbid = xlxl[1][data.hb]
                        if p3 == 2 then
                            changemoney(dx,hbid,"=",data.sl,"后台",true)
                            sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.mz..']货币数量修改为['..data.sl..']</font>","Type":9}')
                        else
                            changemoney(dx,hbid,"+",data.sl,"后台",true)
                            sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.mz..']增加['..data.sl..']当前货币剩余：'..querymoney(dx,xlxl[1][data.hb])..'</font>","Type":9}')
                        end
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                    end
                end
            elseif p3 == 4 then
                local data = json2tbl(msg)
                if data and data.mz and data.hb and data.hb > 0 and data.hb < 11 then
                    local dx,sy = getplayerbyname(data.mz),data.hb
                    if dx then
                        setplaydef(dx, VarCfg.U_czyz,data.hb)
                        changemoney(dx,7,"+",xlxl[2][data.hb]*100,"",true)
                        recharge(dx, xlxl[2][data.hb], "gm", 7, false)
                        sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..data.mz..']发送礼包成功</font>","Type":9}')
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                    end
                end
            elseif p3 == 5 then
                local data = json2tbl(msg)
                if data and data.mz and data.hb and data.hb > 0 and data.hb < 11 then
                    local dx,sy = getplayerbyname(data.mz),data.hb
                    if dx then
                        recharge(dx, xlxl[3][data.hb], "gm", 21, false)
                        sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..data.mz..']发送礼包成功</font>","Type":9}')
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                    end
                end
            end
        elseif p2 == 2 then
            local data = json2tbl(msg)
            if p3 == 5 then
                setcastleguild(data.ch, 0)
                return
            end
            if data and data.mz then
                local dx = getplayerbyname(data.mz)
                if dx then
                    if getstditeminfo(data.wp,1) == data.wp then
                        if p3 == 1 then
                            if data.lx then
                                giveitem(dx,data.wp,data.sl,data.lx == 1 and 850 or 0)
                                sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..data.wp..']增加完成</font>","Type":9}')
                            end
                        elseif p3 == 2 then
                            takeitem(dx,data.wp,data.sl)
                            sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.wp..']扣除完成</font>","Type":9}')
                        elseif p3 == 4 then
                            if checktitle(dx,data.ch) then
                                sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>拿...</font>","Type":9}')
                                Player.title_del(dx,data.ch)
                            else
                                sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>给...</font>","Type":9}')
                                Player.title_give(dx,data.ch)
                            end
                        end
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>物品名字不正确</font>","Type":9}')
                    end
                else
                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                end
            end
        elseif p2 == 3 then
            local data = json2tbl(msg)
            if data and data.mz and data.bl and data.lx > 0 then
                local dx = getplayerbyname(data.mz)
                if data.lx ~= 4 then
                    if dx  then
                        if p3 == 1 then
                            if data.lx == 1 then
                                if data.bl == "积分" then
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.mz..']礼包积分剩余：'..querymoney(dx,22)..'</font>","Type":9}')
                                elseif string.find(data.bl,"t") or string.find(data.bl,"T") or string.find(data.bl,"S") then
                                    mircopy(play,getplaydef(dx,data.bl))
                                    messagebox(play,"["..data.bl.."]的值\\"..getplaydef(dx,data.bl).."")
                                else
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.bl..']的值['..getplaydef(dx,data.bl)..']</font>","Type":9}')
                                end
                            elseif data.lx == 2 then
                                sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>标识：['..data.bl..']的值['..getflagstatus(dx,data.bl)..']</font>","Type":9}')
                            elseif data.lx == 3 then
                                if hasbuff(dx,data.bl) then
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>buff:['..data.bl..']的值['..math.floor((getbuffinfo(dx,data.bl,2)/60))..'分钟]</font>","Type":9}')
                                else
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家没有这个BUFF</font>","Type":9}')
                                end
                            end
                        else
                            if data.zhi then
                                if data.lx == 1 then
                                    if data.bl == "积分" then
                                        changemoney(dx,22,"+",data.zhi,"后台",true)
                                        sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.mz..']增加['..data.zhi..']当前礼包积分剩余：'..querymoney(dx,22)..'</font>","Type":9}')
                                    else
                                        setplaydef(dx,data.bl,data.zhi)
                                        sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.bl..']的值['..getplaydef(dx,data.bl)..']</font>","Type":9}')
                                    end
                                elseif data.lx == 2 then
                                    setflagstatus(dx,data.bl,data.zhi)
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>标识：['..data.bl..']的值['..getflagstatus(dx,data.bl)..']</font>","Type":9}')
                                elseif data.lx == 3 then
                                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0500\'>BUFF只能查询</font>","Type":9}')
                                end
                            end
                        end
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                    end
                elseif data.lx == 4 then
                    if p3 == 1 then
                        if string.find(data.bl,"A") or string.find(data.bl,"a") then
                            messagebox(play,"["..data.bl.."]的值\\"..getsysvar(data.bl).."")
                        else
                            sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.bl..']的值['..getsysvar(data.bl)..']</font>","Type":9}')
                        end
                    elseif p3 == 2 then
                        if data.zhi then
                            setsysvar(data.bl,data.zhi)
                            sendmsg(play, 1, '{"Msg":"<font color=\'#00ff00\'>['..data.bl..']的值['..getsysvar(data.bl)..']</font>","Type":9}')
                        end
                    end
                end
            end
        elseif p2 == 4 then
            if msg ~= "" then
                local dx = getplayerbyname(msg)
                if p3 == 1 then
                    if dx  then
                        kick(dx)
                        sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..msg..']踢下线</font>","Type":9}')
                    else
                        sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..msg..']玩家不在线</font>","Type":9}')
                    end
                elseif p3 < 4 then
                    setgmlevel(play,10)
                    if p3 == 2 then
                        gmexecute(play,"DenyCharNameLogon",msg,1)
                        sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..msg..']加入封禁列表</font>","Type":9}')
                        if dx then
                            callscriptex(dx, "CHANGELEVEL", "=", 1)
                        end
                    elseif p3 == 3 then
                        gmexecute(play,"DelDenyCharNameLogon",msg)
                        sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..msg..']去除封禁列表</font>","Type":9}')
                    end
                    setgmlevel(play,0)
                end
            end
            if p3 == 4 then
                setgmlevel(play,10)
                gmexecute(play,"ShowDenyCharNameLogon")
                setgmlevel(play,0)
            end
        elseif p2 == 5 then
            local data = json2tbl(msg)
            if data and data.mz and data.hb and data.hb > 0 then
                local dx,sy = getplayerbyname(data.mz),data.hb
                if dx then
                    changemoney(dx,7,"+",data.hb*100,"",true)
                    recharge(dx, data.hb, "gm", 7, false)
                    sendmsg(play, 1, '{"Msg":"<font color=\'#28ef01\'>['..data.mz..']发送礼包成功</font>","Type":9}')
                else
                    sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>['..data.mz..']玩家不在线</font>","Type":9}')
                end
            end
        end
    end
end

npc[1004] = function(play,p2,p3,msg)  --排行榜查询
    if p2 == 1 then
        local dx = getplayerbyid(msg)
        if dx then
            sendmsg(dx, 1, '{"BColor":249,"FColor":255,"Msg":"<outline size=\'1\'><font color=\'#FFFF00\'></font>玩家<font color=\'#00ff00\'>[' .. getbaseinfo(play, 1) .. ']</font>在偷偷打量你</outline>","Type":1}')
            sendluamsg(play,101,1004,0,0,'{"userid":"'..msg..'","zdl":'..querymoney(dx,29)..'}')
        else
            sendmsg(play, 1, '{"Msg":"<font color=\'#ff0000\'>玩家不在线</font>","Type":9}')
        end
    end
end


return npc